
{
  "10": {
    "Chủ đề: Công nghệ trồng trọt cơ bản": {
      "chapter": "CÔNG NGHỆ TRỒNG TRỌT",
      "content": "Nghiên cứu các kỹ thuật cơ bản trong trồng trọt và chăm sóc cây trồng.",
      "objectives": [
        "Trình bày được quy trình trồng một loại cây phổ biến.",
        "Phân tích được ảnh hưởng của đất và nước đến cây trồng.",
        "Hiểu được ứng dụng công nghệ trong trồng trọt.",
        "Liên hệ thực tiễn về canh tác tại địa phương."
      ],
      "common_exercises": [
        "Vẽ sơ đồ quy trình trồng lúa.",
        "Phân tích ảnh hưởng của phân bón đến năng suất.",
        "Liên hệ thực tiễn về tưới tiêu ở vùng đồng bằng."
      ]
    },
    "Chuyên đề: Chăn nuôi cơ bản": {
      "chapter": "CÔNG NGHỆ CHĂN NUÔI",
      "content": "Tìm hiểu kỹ thuật chăn nuôi và chăm sóc gia súc, gia cầm.",
      "objectives": [
        "Trình bày được quy trình chăn nuôi một loại gia súc.",
        "Phân tích được ảnh hưởng của thức ăn đến chăn nuôi.",
        "Hiểu được ứng dụng công nghệ trong chăn nuôi.",
        "Liên hệ thực tiễn về chăn nuôi tại địa phương."
      ],
      "common_exercises": [
        "Phân tích quy trình chăm sóc gà thịt.",
        "Thảo luận về vai trò của thức ăn trong chăn nuôi.",
        "Đánh giá hiệu quả của chuồng trại hiện đại."
      ]
    }
  },
  "11": {
    "Chủ đề: Công nghệ bảo quản nông sản": {
      "chapter": "CÔNG NGHỆ BẢO QUẢN",
      "content": "Nghiên cứu các phương pháp bảo quản nông sản và ứng dụng thực tế.",
      "objectives": [
        "Trình bày được các phương pháp bảo quản nông sản.",
        "Phân tích được tác động của bảo quản đến chất lượng.",
        "Hiểu được ứng dụng công nghệ trong bảo quản.",
        "Liên hệ thực tiễn về bảo quản trái cây."
      ],
      "common_exercises": [
        "Phân tích quy trình bảo quản rau quả.",
        "Thảo luận về tác động của nhiệt độ trong bảo quản.",
        "Đánh giá hiệu quả của công nghệ lạnh."
      ]
    },
    "Chuyên đề: Công nghệ thủy sản": {
      "chapter": "CÔNG NGHỆ THỦY SẢN",
      "content": "Tìm hiểu kỹ thuật nuôi trồng thủy sản và quản lý môi trường nước.",
      "objectives": [
        "Trình bày được quy trình nuôi cá nước ngọt.",
        "Phân tích được ảnh hưởng của môi trường nước đến thủy sản.",
        "Hiểu được ứng dụng công nghệ trong thủy sản.",
        "Liên hệ thực tiễn về nuôi tôm ở Việt Nam."
      ],
      "common_exercises": [
        "Phân tích quy trình nuôi tôm công nghiệp.",
        "Thảo luận về quản lý nước trong nuôi thủy sản.",
        "Đánh giá vai trò của công nghệ trong thủy sản."
      ]
    }
  },
  "12": {
    "Chủ đề: Công nghệ sản xuất nông nghiệp bền vững": {
      "chapter": "CÔNG NGHỆ NÔNG NGHIỆP BỀN VỮNG",
      "content": "Nghiên cứu các phương pháp sản xuất nông nghiệp bền vững và bảo vệ môi trường.",
      "objectives": [
        "Trình bày được khái niệm nông nghiệp bền vững.",
        "Phân tích được tác động của nông nghiệp đến môi trường.",
        "Hiểu được biện pháp sản xuất bền vững.",
        "Liên hệ thực tiễn về nông nghiệp hữu cơ."
      ],
      "common_exercises": [
        "Phân tích tác động của thuốc bảo vệ thực vật.",
        "Thảo luận về nông nghiệp hữu cơ ở Việt Nam.",
        "Đánh giá hiệu quả của canh tác bền vững."
      ]
    },
    "Chuyên đề: Quản lý kinh tế nông nghiệp": {
      "chapter": "QUẢN LÝ NÔNG NGHIỆP",
      "content": "Tìm hiểu các phương pháp quản lý kinh tế trong sản xuất nông nghiệp.",
      "objectives": [
        "Trình bày được khái niệm quản lý kinh tế nông nghiệp.",
        "Phân tích được quy trình tối ưu hóa sản xuất.",
        "Hiểu được vai trò của quản lý trong nông nghiệp.",
        "Liên hệ thực tiễn về hợp tác xã nông nghiệp."
      ],
      "common_exercises": [
        "Phân tích một mô hình hợp tác xã thành công.",
        "Thảo luận về tối ưu hóa chi phí trong nông nghiệp.",
        "Đánh giá vai trò của quản lý trong tăng năng suất."
      ]
    }
  }
}
