
{
  "1": {
    "Bài 1. Số và phép tính trong phạm vi 100": {
      "chapter": "SỐ VÀ PHÉP TÍNH",
      "content": "Đếm, đọc, viết, so sánh các số đến 100. Thực hiện phép cộng, trừ không nhớ và có nhớ trong phạm vi 100.",
      "objectives": [
        "Đếm, đọc, viết các số trong phạm vi 100.",
        "So sánh và sắp xếp các số trong phạm vi 100.",
        "Nhận biết cấu tạo thập phân của số có hai chữ số.",
        "Thực hiện thành thạo phép cộng, trừ không nhớ trong phạm vi 100.",
        "Làm quen với việc thực hiện phép cộng, trừ có nhớ trong phạm vi 100.",
        "Tính nhẩm trong các trường hợp đơn giản.",
        "Giải quyết các bài toán thực tế liên quan đến cộng, trừ."
      ],
      "common_exercises": []
    },
    "Bài 2. Hình học và đo lường cơ bản": {
      "chapter": "HÌNH HỌC VÀ ĐO LƯỜNG",
      "content": "Nhận dạng các hình phẳng và hình khối quen thuộc. Làm quen với đo độ dài, thời gian và tiền Việt Nam.",
      "objectives": [
        "Nhận dạng hình vuông, hình tròn, hình tam giác, hình chữ nhật.",
        "Nhận dạng khối hộp chữ nhật, khối lập phương.",
        "Xác định vị trí (trước-sau, trên-dưới, phải-trái).",
        "Lắp ghép, xếp hình đơn giản.",
        "Làm quen với đơn vị đo độ dài (cm) và thực hành đo.",
        "Nhận biết và đọc giờ đúng trên đồng hồ.",
        "Nhận biết các ngày trong tuần.",
        "Nhận biết và sử dụng một số tờ tiền Việt Nam."
      ],
      "common_exercises": []
    },
    "Bài 3. Làm quen với Thống kê và Xác suất": {
      "chapter": "MỘT SỐ YẾU TỐ THỐNG KÊ VÀ XÁC SUẤT",
      "content": "Làm quen với việc thu thập, phân loại và kiểm đếm dữ liệu. Bước đầu nhận biết các khả năng xảy ra của một sự kiện.",
      "objectives": [
        "Thực hiện thu thập, phân loại, kiểm đếm các đối tượng trong một số tình huống đơn giản.",
        "Đọc biểu đồ tranh.",
        "Làm quen, mô tả các khả năng có thể xảy ra (chắc chắn, có thể, không thể) của một sự kiện."
      ],
      "common_exercises": []
    }
  },
  "2": {
    "Bài 1. Số và phép tính trong phạm vi 1000": {
      "chapter": "SỐ VÀ PHÉP TÍNH",
      "content": "Nghiên cứu về số tự nhiên đến 1000, các phép cộng, trừ có nhớ và làm quen với phép nhân, chia.",
      "objectives": [
        "Đọc, viết, so sánh các số có ba chữ số.",
        "Nhận biết cấu tạo thập phân của số có ba chữ số.",
        "Thực hiện thành thạo phép cộng, trừ có nhớ trong phạm vi 1000.",
        "Nhận biết ý nghĩa của phép nhân, phép chia.",
        "Thuộc bảng nhân, chia 2, 3, 4, 5.",
        "Thực hiện phép nhân, chia (trong bảng) với các số có đến ba chữ số.",
        "Tính giá trị biểu thức số có đến hai dấu phép tính cộng, trừ hoặc nhân, chia.",
        "Giải quyết các bài toán liên quan đến các phép tính đã học."
      ],
      "common_exercises": []
    },
    "Bài 2. Hình học và đo lường nâng cao": {
      "chapter": "HÌNH HỌC VÀ ĐO LƯỜNG",
      "content": "Nhận dạng đường thẳng, đường cong, đường gấp khúc. Sử dụng các đơn vị đo độ dài, khối lượng, thời gian, dung tích.",
      "objectives": [
        "Nhận dạng đường thẳng, đường cong, ba điểm thẳng hàng.",
        "Nhận dạng đường gấp khúc, tính độ dài đường gấp khúc.",
        "Nhận biết và tính chu vi hình tam giác, hình tứ giác.",
        "Sử dụng các đơn vị đo độ dài: dm, m, km.",
        "Sử dụng các đơn vị đo khối lượng: kg.",
        "Sử dụng các đơn vị đo dung tích: lít.",
        "Xem lịch (ngày, tháng) và đọc giờ (đến nửa giờ).",
        "Giải các bài toán thực tế liên quan đến đo lường."
      ],
      "common_exercises": []
    },
    "Bài 3. Thu thập và biểu diễn dữ liệu": {
      "chapter": "MỘT SỐ YẾU TỐ THỐNG KÊ VÀ XÁC SUẤT",
      "content": "Thu thập, phân loại dữ liệu và biểu diễn bằng biểu đồ tranh. Nhận xét và rút ra kết luận đơn giản từ biểu đồ.",
      "objectives": [
        "Thực hiện thu thập, phân loại, ghi chép số liệu thống kê.",
        "Đọc và mô tả số liệu ở dạng bảng.",
        "Đọc và mô tả số liệu ở dạng biểu đồ tranh.",
        "Nhận xét, so sánh từ bảng số liệu, biểu đồ tranh."
      ],
      "common_exercises": []
    }
  },
  "3": {
    "Bài 1. Số và phép tính trong phạm vi 100 000": {
      "chapter": "SỐ VÀ PHÉP TÍNH",
      "content": "Nghiên cứu về số tự nhiên đến 100 000, các phép toán cộng, trừ, nhân, chia và làm tròn số.",
      "objectives": [
        "Đọc, viết, so sánh các số có đến năm chữ số.",
        "Thực hiện cộng, trừ các số có đến năm chữ số.",
        "Hoàn thành các bảng nhân, chia từ 6 đến 9.",
        "Thực hiện phép nhân số có đến năm chữ số với số có một chữ số.",
        "Thực hiện phép chia số có đến năm chữ số cho số có một chữ số (chia hết và chia có dư).",
        "Làm quen với biểu thức số có dấu ngoặc.",
        "Làm tròn số đến hàng chục, hàng trăm.",
        "Giải các bài toán gắn với thực tế (bài toán gấp một số lên nhiều lần, giảm đi một số lần,...)"
      ],
      "common_exercises": []
    },
    "Bài 2. Hình học và đo lường thực hành": {
      "chapter": "HÌNH HỌC VÀ ĐO LƯỜNG",
      "content": "Tìm hiểu về góc vuông, góc không vuông, hình chữ nhật, hình vuông. Đo lường diện tích và các đơn vị đo quen thuộc.",
      "objectives": [
        "Nhận biết góc vuông, góc không vuông.",
        "Nhận biết hình chữ nhật, hình vuông và các đặc điểm của chúng.",
        "Tính chu vi, diện tích hình chữ nhật, hình vuông.",
        "Làm quen với đơn vị đo diện tích (cm²).",
        "Sử dụng các đơn vị đo khối lượng: gam.",
        "Sử dụng các đơn vị đo thời gian: tháng, năm, giờ, phút.",
        "Thực hành xem đồng hồ chính xác đến từng phút.",
        "Giải các bài toán thực tế về đo lường."
      ],
      "common_exercises": []
    },
    "Bài 3. Thống kê và xác suất ứng dụng": {
      "chapter": "MỘT SỐ YẾU TỐ THỐNG KÊ VÀ XÁC SUẤT",
      "content": "Làm quen với bảng số liệu và biểu đồ cột. Phân tích dữ liệu và nhận biết các sự kiện có thể xảy ra.",
      "objectives": [
        "Làm quen với việc thu thập, tổ chức, biểu diễn, phân tích và xử lí số liệu thống kê.",
        "Đọc, mô tả, nhận xét các số liệu trong một bảng.",
        "Làm quen với biểu đồ cột.",
        "Nhận biết và mô tả các khả năng xảy ra của một sự kiện (chắc chắn, có thể, không thể)."
      ],
      "common_exercises": []
    }
  },
  "4": {
    "Bài 1. Số tự nhiên. Dấu hiệu chia hết": {
      "chapter": "SỐ VÀ PHÉP TÍNH",
      "content": "Ôn tập và hệ thống hóa kiến thức về số tự nhiên, các phép toán. Nghiên cứu dấu hiệu chia hết, phân số và các phép tính với phân số.",
      "objectives": [
        "Đọc, viết, so sánh các số tự nhiên, làm quen với lớp triệu.",
        "Thực hiện bốn phép tính với các số tự nhiên.",
        "Vận dụng các tính chất giao hoán, kết hợp, phân phối để tính thuận tiện.",
        "Vận dụng dấu hiệu chia hết cho 2, 5, 9, 3.",
        "Giải các bài toán tìm số trung bình cộng và các bài toán thực tế khác."
      ],
      "common_exercises": []
    },
    "Bài 2. Phân số và các phép toán": {
      "chapter": "SỐ VÀ PHÉP TÍNH",
      "content": "Nghiên cứu về phân số, các tính chất, so sánh và thực hiện bốn phép toán với phân số. Tìm hiểu về tỉ số.",
      "objectives": [
        "Nhận biết khái niệm ban đầu về phân số, phân số và phép chia số tự nhiên.",
        "Áp dụng tính chất cơ bản để rút gọn, quy đồng mẫu số các phân số.",
        "So sánh và sắp xếp các phân số.",
        "Thực hiện bốn phép tính cộng, trừ, nhân, chia với phân số.",
        "Giải các bài toán về tìm phân số của một số và các bài toán thực tế khác.",
        "Nhận biết về tỉ số."
      ],
      "common_exercises": []
    },
    "Bài 3. Hình học và đo lường mở rộng": {
      "chapter": "HÌNH HỌC VÀ ĐO LƯỜNG",
      "content": "Nhận biết góc nhọn, tù, bẹt, hai đường thẳng song song, vuông góc. Tính diện tích hình bình hành, hình thoi.",
      "objectives": [
        "Nhận biết góc nhọn, góc tù, góc bẹt.",
        "Nhận biết hai đường thẳng vuông góc, hai đường thẳng song song.",
        "Nhận biết hình bình hành, hình thoi và các đặc điểm của chúng.",
        "Tính diện tích hình bình hành, hình thoi.",
        "Sử dụng các đơn vị đo khối lượng: yến, tạ, tấn.",
        "Sử dụng các đơn vị đo thời gian: giây, thế kỉ.",
        "Sử dụng các đơn vị đo diện tích: dm², m²."
      ],
      "common_exercises": []
    },
    "Bài 4. Biểu đồ và phân tích dữ liệu": {
      "chapter": "MỘT SỐ YẾU TỐ THỐNG KÊ VÀ XÁC SUẤT",
      "content": "Thu thập số liệu, đọc và phân tích dữ liệu từ bảng số liệu và biểu đồ cột.",
      "objectives": [
        "Thu thập và ghi chép số liệu thống kê.",
        "Lập bảng số liệu.",
        "Đọc, mô tả, phân tích và xử lí số liệu trên bảng và biểu đồ cột."
      ],
      "common_exercises": []
    }
  },
  "5": {
    "Bài 1. Phân số thập phân và số thập phân": {
      "chapter": "SỐ VÀ PHÉP TÍNH",
      "content": "Tìm hiểu về phân số thập phân, hỗn số, số thập phân và các phép toán với số thập phân.",
      "objectives": [
        "Nhận biết và sử dụng hỗn số.",
        "Đọc, viết, so sánh phân số thập phân, số thập phân.",
        "Chuyển đổi các số đo đại lượng dưới dạng số thập phân.",
        "Thực hiện bốn phép tính cộng, trừ, nhân, chia với số thập phân."
      ],
      "common_exercises": []
    },
    "Bài 2. Tỉ số phần trăm và ứng dụng": {
      "chapter": "SỐ VÀ PHÉP TÍNH",
      "content": "Nghiên cứu về tỉ số phần trăm và giải các bài toán liên quan đến tỉ số phần trăm.",
      "objectives": [
        "Nhận biết khái niệm tỉ số phần trăm.",
        "Đọc, viết, và thực hiện các phép tính với tỉ số phần trăm.",
        "Giải ba dạng bài toán cơ bản về tỉ số phần trăm.",
        "Giải các bài toán thực tế liên quan đến tỉ số phần trăm (tính lãi suất, mua bán,...)"
      ],
      "common_exercises": []
    },
    "Bài 3. Hình học và đo lường tổng hợp": {
      "chapter": "HÌNH HỌC VÀ ĐO LƯỜNG",
      "content": "Tính diện tích các hình đã học, làm quen với hình thang, hình tròn. Tính thể tích hình hộp chữ nhật, hình lập phương.",
      "objectives": [
        "Tính diện tích hình tam giác, hình thang.",
        "Nhận biết hình tròn, đường tròn và các yếu tố liên quan (tâm, bán kính, đường kính).",
        "Tính chu vi, diện tích hình tròn.",
        "Nhận biết hình hộp chữ nhật, hình lập phương và các đặc điểm của chúng.",
        "Tính diện tích xung quanh, diện tích toàn phần, thể tích của hình hộp chữ nhật, hình lập phương.",
        "Sử dụng các đơn vị đo diện tích (dam², hm², km²) và đo thể tích (cm³, dm³, m³)."
      ],
      "common_exercises": []
    },
    "Bài 4. Số đo thời gian và toán chuyển động đều": {
      "chapter": "SỐ VÀ PHÉP TÍNH",
      "content": "Nghiên cứu về các phép toán với số đo thời gian và giải các bài toán về chuyển động đều.",
      "objectives": [
        "Thực hiện các phép tính cộng, trừ, nhân, chia số đo thời gian.",
        "Nhận biết các đại lượng trong chuyển động đều (vận tốc, quãng đường, thời gian).",
        "Tính vận tốc, quãng đường, thời gian trong chuyển động đều.",
        "Giải các bài toán thực tế về chuyển động cùng chiều, ngược chiều."
      ],
      "common_exercises": []
    },
    "Bài 5. Thống kê và Biểu đồ": {
      "chapter": "MỘT SỐ YẾU TỐ THỐNG KÊ VÀ XÁC SUẤT",
      "content": "Làm quen với biểu đồ hình quạt tròn và phân tích, xử lí số liệu từ các loại biểu đồ đã học.",
      "objectives": [
        "Đọc, mô tả, phân tích và xử lí số liệu trên các biểu đồ đã học (tranh, cột).",
        "Làm quen với biểu đồ hình quạt tròn."
      ],
      "common_exercises": []
    }
  },
  "6": {
    "Bài 1. Tập hợp": {
      "chapter": "TẬP HỢP CÁC SỐ TỰ NHIÊN",
      "content": "Nghiên cứu về tập hợp, cách ghi số tự nhiên, các phép toán (cộng, trừ, nhân, chia, luỹ thừa) và thứ tự thực hiện phép tính.",
      "objectives": [
        "Nhận biết một đối tượng cụ thể thuộc hay không thuộc một tập hợp cho trước.",
        "Viết một tập hợp cho trước bằng cách liệt kê các phần tử của nó.",
        "Viết một tập hợp cho trước bằng cách chỉ ra tính chất đặc trưng cho các phần tử của nó.",
        "Sử dụng đúng các kí hiệu ∈, ∉."
      ],
      "common_exercises": []
    },
    "Bài 2. Cách ghi số tự nhiên": {
      "chapter": "TẬP HỢP CÁC SỐ TỰ NHIÊN",
      "content": "Nghiên cứu về tập hợp, cách ghi số tự nhiên, các phép toán (cộng, trừ, nhân, chia, luỹ thừa) và thứ tự thực hiện phép tính.",
      "objectives": [
        "Đọc và viết các số tự nhiên.",
        "Biểu diễn một số tự nhiên thành tổng giá trị các chữ số của nó.",
        "Xác định giá trị của một chữ số trong một số tự nhiên cụ thể.",
        "Đọc và viết các số La Mã từ 1 đến 30."
      ],
      "common_exercises": []
    },
    "Bài 3. Thứ tự trong tập hợp các số tự nhiên": {
      "chapter": "TẬP HỢP CÁC SỐ TỰ NHIÊN",
      "content": "Nghiên cứu về tập hợp, cách ghi số tự nhiên, các phép toán (cộng, trừ, nhân, chia, luỹ thừa) và thứ tự thực hiện phép tính.",
      "objectives": [
        "So sánh hai số tự nhiên cho trước.",
        "Sắp xếp một dãy các số tự nhiên theo thứ tự tăng hoặc giảm dần.",
        "Sử dụng các kí hiệu <, >, ≤, ≥ để biểu diễn thứ tự.",
        "Tìm số liền trước, số liền sau của một số tự nhiên."
      ],
      "common_exercises": []
    },
    "Bài 4. Phép cộng và phép trừ số tự nhiên": {
      "chapter": "TẬP HỢP CÁC SỐ TỰ NHIÊN",
      "content": "Nghiên cứu về tập hợp, cách ghi số tự nhiên, các phép toán (cộng, trừ, nhân, chia, luỹ thừa) và thứ tự thực hiện phép tính.",
      "objectives": [
        "Thực hiện thành thạo phép cộng và phép trừ các số tự nhiên.",
        "Áp dụng tính chất giao hoán, kết hợp của phép cộng để tính nhẩm, tính nhanh.",
        "Giải các bài toán thực tế liên quan đến phép cộng và phép trừ."
      ],
      "common_exercises": []
    },
    "Bài 5. Phép nhân và phép chia số tự nhiên": {
      "chapter": "TẬP HỢP CÁC SỐ TỰ NHIÊN",
      "content": "Nghiên cứu về tập hợp, cách ghi số tự nhiên, các phép toán (cộng, trừ, nhân, chia, luỹ thừa) và thứ tự thực hiện phép tính.",
      "objectives": [
        "Thực hiện thành thạo phép nhân và phép chia (chia hết và chia có dư) các số tự nhiên.",
        "Áp dụng tính chất giao hoán, kết hợp, phân phối của phép nhân để tính nhẩm, tính nhanh.",
        "Giải các bài toán thực tế liên quan đến phép nhân và phép chia."
      ],
      "common_exercises": []
    },
    "Bài 6. Luỹ thừa với số mũ tự nhiên": {
      "chapter": "TẬP HỢP CÁC SỐ TỰ NHIÊN",
      "content": "Nghiên cứu về tập hợp, cách ghi số tự nhiên, các phép toán (cộng, trừ, nhân, chia, luỹ thừa) và thứ tự thực hiện phép tính.",
      "objectives": [
        "Viết một tích các thừa số bằng nhau dưới dạng luỹ thừa.",
        "Tính giá trị của một luỹ thừa.",
        "Thực hiện phép nhân và chia hai luỹ thừa cùng cơ số.",
        "So sánh hai luỹ thừa cùng cơ số."
      ],
      "common_exercises": []
    },
    "Bài 7. Thứ tự thực hiện các phép tính": {
      "chapter": "TẬP HỢP CÁC SỐ TỰ NHIÊN",
      "content": "Nghiên cứu về tập hợp, cách ghi số tự nhiên, các phép toán (cộng, trừ, nhân, chia, luỹ thừa) và thứ tự thực hiện phép tính.",
      "objectives": [
        "Áp dụng đúng thứ tự thực hiện các phép tính (luỹ thừa, nhân, chia, cộng, trừ) trong biểu thức không có dấu ngoặc.",
        "Áp dụng đúng thứ tự thực hiện các phép tính trong biểu thức có dấu ngoặc (), [], {}."
      ],
      "common_exercises": []
    },
    "Bài 8. Quan hệ chia hết và tính chất": {
      "chapter": "TÍNH CHIA HẾT TRONG TẬP HỢP CÁC SỐ TỰ NHIÊN",
      "content": "Tìm hiểu về quan hệ chia hết, dấu hiệu chia hết, số nguyên tố, ước chung và bội chung.",
      "objectives": [
        "Nhận biết một số có chia hết cho một số khác hay không.",
        "Tìm tất cả các ước của một số tự nhiên.",
        "Tìm các bội của một số tự nhiên trong một khoảng cho trước.",
        "Áp dụng tính chất chia hết của một tổng (hiệu) để xét tính chia hết."
      ],
      "common_exercises": []
    },
    "Bài 9. Dấu hiệu chia hết": {
      "chapter": "TÍNH CHIA HẾT TRONG TẬP HỢP CÁC SỐ TỰ NHIÊN",
      "content": "Tìm hiểu về quan hệ chia hết, dấu hiệu chia hết, số nguyên tố, ước chung và bội chung.",
      "objectives": [
        "Vận dụng dấu hiệu chia hết cho 2, 5 để xác định một số có chia hết cho 2, 5 hay không.",
        "Vận dụng dấu hiệu chia hết cho 3, 9 để xác định một số có chia hết cho 3, 9 hay không.",
        "Tìm chữ số chưa biết để một số chia hết cho 2, 3, 5, 9."
      ],
      "common_exercises": []
    },
    "Bài 10. Số nguyên tố": {
      "chapter": "TÍNH CHIA HẾT TRONG TẬP HỢP CÁC SỐ TỰ NHIÊN",
      "content": "Tìm hiểu về quan hệ chia hết, dấu hiệu chia hết, số nguyên tố, ước chung và bội chung.",
      "objectives": [
        "Phân biệt số nguyên tố và hợp số.",
        "Phân tích một số tự nhiên lớn hơn 1 ra thừa số nguyên tố bằng sơ đồ cột hoặc sơ đồ cây."
      ],
      "common_exercises": []
    },
    "Bài 11. Ước chung. Ước chung lớn nhất": {
      "chapter": "TÍNH CHIA HẾT TRONG TẬP HỢP CÁC SỐ TỰ NHIÊN",
      "content": "Tìm hiểu về quan hệ chia hết, dấu hiệu chia hết, số nguyên tố, ước chung và bội chung.",
      "objectives": [
        "Tìm tập hợp ước chung của hai hay nhiều số.",
        "Tìm ƯCLN của hai hay nhiều số bằng cách phân tích ra thừa số nguyên tố.",
        "Tìm tập hợp ước chung thông qua ƯCLN.",
        "Giải các bài toán thực tế liên quan đến ƯCLN."
      ],
      "common_exercises": []
    },
    "Bài 12. Bội chung. Bội chung nhỏ nhất": {
      "chapter": "TÍNH CHIA HẾT TRONG TẬP HỢP CÁC SỐ TỰ NHIÊN",
      "content": "Tìm hiểu về quan hệ chia hết, dấu hiệu chia hết, số nguyên tố, ước chung và bội chung.",
      "objectives": [
        "Tìm tập hợp bội chung của hai hay nhiều số.",
        "Tìm BCNN của hai hay nhiều số bằng cách phân tích ra thừa số nguyên tố.",
        "Tìm tập hợp bội chung thông qua BCNN.",
        "Giải các bài toán thực tế liên quan đến BCNN."
      ],
      "common_exercises": []
    },
    "Bài 13. Tập hợp các số nguyên": {
      "chapter": "SỐ NGUYÊN",
      "content": "Mở rộng sang tập hợp số nguyên, bao gồm các phép toán, quy tắc dấu ngoặc, ước và bội của số nguyên.",
      "objectives": [
        "Biểu diễn số nguyên trên trục số.",
        "So sánh hai số nguyên.",
        "Tìm số đối của một số nguyên.",
        "Nhận biết ý nghĩa của số nguyên âm trong các tình huống thực tế."
      ],
      "common_exercises": []
    },
    "Bài 14. Phép cộng và phép trừ số nguyên": {
      "chapter": "SỐ NGUYÊN",
      "content": "Mở rộng sang tập hợp số nguyên, bao gồm các phép toán, quy tắc dấu ngoặc, ước và bội của số nguyên.",
      "objectives": [
        "Thực hiện phép cộng hai số nguyên cùng dấu, khác dấu.",
        "Thực hiện phép trừ hai số nguyên.",
        "Áp dụng tính chất giao hoán, kết hợp của phép cộng số nguyên để tính nhanh."
      ],
      "common_exercises": []
    },
    "Bài 15. Quy tắc dấu ngoặc": {
      "chapter": "SỐ NGUYÊN",
      "content": "Mở rộng sang tập hợp số nguyên, bao gồm các phép toán, quy tắc dấu ngoặc, ước và bội của số nguyên.",
      "objectives": [
        "Áp dụng quy tắc dấu ngoặc để bỏ ngoặc trong biểu thức có dấu cộng hoặc dấu trừ đằng trước.",
        "Sử dụng quy tắc dấu ngoặc và các tính chất để tính giá trị biểu thức một cách hợp lý."
      ],
      "common_exercises": []
    },
    "Bài 16. Phép nhân số nguyên": {
      "chapter": "SỐ NGUYÊN",
      "content": "Mở rộng sang tập hợp số nguyên, bao gồm các phép toán, quy tắc dấu ngoặc, ước và bội của số nguyên.",
      "objectives": [
        "Thực hiện phép nhân hai số nguyên cùng dấu, khác dấu.",
        "Áp dụng tính chất giao hoán, kết hợp, phân phối của phép nhân để tính nhanh."
      ],
      "common_exercises": []
    },
    "Bài 17. Phép chia hết. Ước và bội của một số nguyên": {
      "chapter": "SỐ NGUYÊN",
      "content": "Mở rộng sang tập hợp số nguyên, bao gồm các phép toán, quy tắc dấu ngoặc, ước và bội của số nguyên.",
      "objectives": [
        "Thực hiện phép chia hết hai số nguyên.",
        "Tìm tất cả các ước của một số nguyên.",
        "Tìm các bội của một số nguyên."
      ],
      "common_exercises": []
    },
    "Bài 18. Hình tam giác đều. Hình vuông. Hình lục giác đều": {
      "chapter": "MỘT SỐ HÌNH PHẲNG TRONG THỰC TIỄN",
      "content": "Nhận dạng, mô tả và tính toán chu vi, diện tích các hình phẳng quen thuộc như tam giác đều, hình vuông, hình chữ nhật, hình thang cân, hình thoi, hình bình hành.",
      "objectives": [
        "Nhận dạng và mô tả các yếu tố (cạnh, góc, đường chéo) của tam giác đều, hình vuông, lục giác đều.",
        "Vẽ tam giác đều, hình vuông bằng thước và compa."
      ],
      "common_exercises": []
    },
    "Bài 19. Hình chữ nhật. Hình thoi. Hình bình hành. Hình thang cân": {
      "chapter": "MỘT SỐ HÌNH PHẲNG TRONG THỰC TIỄN",
      "content": "Nhận dạng, mô tả và tính toán chu vi, diện tích các hình phẳng quen thuộc như tam giác đều, hình vuông, hình chữ nhật, hình thang cân, hình thoi, hình bình hành.",
      "objectives": [
        "Nhận dạng và mô tả các yếu tố (cạnh, góc, đường chéo) của hình chữ nhật, hình thoi, hình bình hành, hình thang cân."
      ],
      "common_exercises": []
    },
    "Bài 20. Chu vi và diện tích của một số tứ giác đã học": {
      "chapter": "MỘT SỐ HÌNH PHẲNG TRONG THỰC TIỄN",
      "content": "Nhận dạng, mô tả và tính toán chu vi, diện tích các hình phẳng quen thuộc như tam giác đều, hình vuông, hình chữ nhật, hình thang cân, hình thoi, hình bình hành.",
      "objectives": [
        "Tính chu vi và diện tích của hình vuông, hình chữ nhật, hình thang cân.",
        "Tính chu vi và diện tích của hình bình hành, hình thoi.",
        "Giải các bài toán thực tế liên quan đến chu vi và diện tích các hình đã học."
      ],
      "common_exercises": []
    },
    "Bài 21. Hình có trục đối xứng": {
      "chapter": "TÍNH ĐỐI XỨNG CỦA HÌNH PHẲNG TRONG TỰ NHIÊN",
      "content": "Khám phá tính đối xứng trục và đối xứng tâm của các hình phẳng trong hình học và tự nhiên.",
      "objectives": [
        "Nhận biết trục đối xứng của các hình phẳng quen thuộc (đoạn thẳng, tam giác đều, hình vuông, hình chữ nhật, hình thoi, hình thang cân, lục giác đều, hình tròn)."
      ],
      "common_exercises": []
    },
    "Bài 22. Hình có tâm đối xứng": {
      "chapter": "TÍNH ĐỐI XỨNG CỦA HÌNH PHẲNG TRONG TỰ NHIÊN",
      "content": "Khám phá tính đối xứng trục và đối xứng tâm của các hình phẳng trong hình học và tự nhiên.",
      "objectives": [
        "Nhận biết tâm đối xứng của các hình phẳng quen thuộc (đoạn thẳng, hình bình hành, hình chữ nhật, hình thoi, hình vuông, lục giác đều, hình tròn)."
      ],
      "common_exercises": []
    },
    "Bài 23. Mở rộng phân số. Phân số bằng nhau": {
      "chapter": "PHÂN SỐ",
      "content": "Nghiên cứu về phân số, các phép toán cộng, trừ, nhân, chia phân số và giải các bài toán liên quan.",
      "objectives": [
        "Nhận biết phân số với tử và mẫu là số nguyên.",
        "Kiểm tra hai phân số có bằng nhau không.",
        "Áp dụng tính chất cơ bản của phân số để rút gọn phân số về dạng tối giản."
      ],
      "common_exercises": []
    },
    "Bài 24. So sánh phân số. Hỗn số dương": {
      "chapter": "PHÂN SỐ",
      "content": "Nghiên cứu về phân số, các phép toán cộng, trừ, nhân, chia phân số và giải các bài toán liên quan.",
      "objectives": [
        "Quy đồng mẫu nhiều phân số.",
        "So sánh hai phân số.",
        "Viết một phân số lớn hơn 1 dưới dạng hỗn số và ngược lại."
      ],
      "common_exercises": []
    },
    "Bài 25. Phép cộng và phép trừ phân số": {
      "chapter": "PHÂN SỐ",
      "content": "Nghiên cứu về phân số, các phép toán cộng, trừ, nhân, chia phân số và giải các bài toán liên quan.",
      "objectives": [
        "Thực hiện phép cộng, trừ hai phân số cùng mẫu, khác mẫu.",
        "Tìm số đối của một phân số.",
        "Áp dụng các tính chất của phép cộng để tính nhanh."
      ],
      "common_exercises": []
    },
    "Bài 26. Phép nhân và phép chia phân số": {
      "chapter": "PHÂN SỐ",
      "content": "Nghiên cứu về phân số, các phép toán cộng, trừ, nhân, chia phân số và giải các bài toán liên quan.",
      "objectives": [
        "Thực hiện phép nhân, chia hai phân số.",
        "Tìm phân số nghịch đảo của một phân số.",
        "Áp dụng các tính chất của phép nhân để tính nhanh."
      ],
      "common_exercises": []
    },
    "Bài 27. Hai bài toán về phân số": {
      "chapter": "PHÂN SỐ",
      "content": "Nghiên cứu về phân số, các phép toán cộng, trừ, nhân, chia phân số và giải các bài toán liên quan.",
      "objectives": [
        "Giải bài toán tìm giá trị phân số của một số cho trước.",
        "Giải bài toán tìm một số khi biết giá trị phân số của nó."
      ],
      "common_exercises": []
    },
    "Bài 28. Số thập phân": {
      "chapter": "SỐ THẬP PHÂN",
      "content": "Tìm hiểu về số thập phân, các phép toán, làm tròn, ước lượng và giải các bài toán về tỉ số, tỉ số phần trăm.",
      "objectives": [
        "Viết phân số thập phân dưới dạng số thập phân và ngược lại.",
        "Tìm số đối của một số thập phân.",
        "So sánh hai số thập phân."
      ],
      "common_exercises": []
    },
    "Bài 29. Tính toán với số thập phân": {
      "chapter": "SỐ THẬP PHÂN",
      "content": "Tìm hiểu về số thập phân, các phép toán, làm tròn, ước lượng và giải các bài toán về tỉ số, tỉ số phần trăm.",
      "objectives": [
        "Thực hiện các phép tính cộng, trừ, nhân, chia số thập phân.",
        "Áp dụng các tính chất của phép tính để tính giá trị biểu thức một cách hợp lý."
      ],
      "common_exercises": []
    },
    "Bài 30. Làm tròn và ước lượng": {
      "chapter": "SỐ THẬP PHÂN",
      "content": "Tìm hiểu về số thập phân, các phép toán, làm tròn, ước lượng và giải các bài toán về tỉ số, tỉ số phần trăm.",
      "objectives": [
        "Làm tròn số thập phân đến một hàng cho trước.",
        "Ước lượng kết quả của phép tính."
      ],
      "common_exercises": []
    },
    "Bài 31. Một số bài toán về tỉ số và tỉ số phần trăm": {
      "chapter": "SỐ THẬP PHÂN",
      "content": "Tìm hiểu về số thập phân, các phép toán, làm tròn, ước lượng và giải các bài toán về tỉ số, tỉ số phần trăm.",
      "objectives": [
        "Tính tỉ số và tỉ số phần trăm của hai đại lượng.",
        "Giải bài toán tìm giá trị phần trăm của một số.",
        "Giải bài toán tìm một số khi biết giá trị phần trăm của nó."
      ],
      "common_exercises": []
    },
    "Bài 32. Điểm và đường thẳng": {
      "chapter": "NHỮNG HÌNH HÌNH HỌC CƠ BẢN",
      "content": "Nghiên cứu các khái niệm cơ bản về hình học như điểm, đường thẳng, tia, đoạn thẳng, trung điểm, góc và số đo góc.",
      "objectives": [
        "Nhận biết điểm thuộc/không thuộc đường thẳng.",
        "Nhận biết ba điểm thẳng hàng.",
        "Xác định hai đường thẳng song song, cắt nhau."
      ],
      "common_exercises": []
    },
    "Bài 33. Điểm nằm giữa hai điểm. Tia": {
      "chapter": "NHỮNG HÌNH HÌNH HỌC CƠ BẢN",
      "content": "Nghiên cứu các khái niệm cơ bản về hình học như điểm, đường thẳng, tia, đoạn thẳng, trung điểm, góc và số đo góc.",
      "objectives": [
        "Nhận biết điểm nằm giữa hai điểm.",
        "Nhận biết hai điểm nằm cùng phía, khác phía đối với một điểm.",
        "Nhận biết tia, hai tia đối nhau."
      ],
      "common_exercises": []
    },
    "Bài 34. Đoạn thẳng. Độ dài đoạn thẳng": {
      "chapter": "NHỮNG HÌNH HÌNH HỌC CƠ BẢN",
      "content": "Nghiên cứu các khái niệm cơ bản về hình học như điểm, đường thẳng, tia, đoạn thẳng, trung điểm, góc và số đo góc.",
      "objectives": [
        "Nhận biết đoạn thẳng, hai đầu mút của đoạn thẳng.",
        "Đo độ dài đoạn thẳng.",
        "So sánh hai đoạn thẳng."
      ],
      "common_exercises": []
    },
    "Bài 35. Trung điểm của đoạn thẳng": {
      "chapter": "NHỮNG HÌNH HÌNH HỌC CƠ BẢN",
      "content": "Nghiên cứu các khái niệm cơ bản về hình học như điểm, đường thẳng, tia, đoạn thẳng, trung điểm, góc và số đo góc.",
      "objectives": [
        "Nhận biết trung điểm của đoạn thẳng.",
        "Tính độ dài đoạn thẳng liên quan đến trung điểm."
      ],
      "common_exercises": []
    },
    "Bài 36. Góc": {
      "chapter": "NHỮNG HÌNH HÌNH HỌC CƠ BẢN",
      "content": "Nghiên cứu các khái niệm cơ bản về hình học như điểm, đường thẳng, tia, đoạn thẳng, trung điểm, góc và số đo góc.",
      "objectives": [
        "Nhận biết góc, đỉnh và cạnh của góc.",
        "Nhận biết góc bẹt.",
        "Nhận biết điểm trong của một góc."
      ],
      "common_exercises": []
    },
    "Bài 37. Số đo góc": {
      "chapter": "NHỮNG HÌNH HÌNH HỌC CƠ BẢN",
      "content": "Nghiên cứu các khái niệm cơ bản về hình học như điểm, đường thẳng, tia, đoạn thẳng, trung điểm, góc và số đo góc.",
      "objectives": [
        "Đo số đo của một góc bằng thước đo góc.",
        "Nhận biết góc vuông, góc nhọn, góc tù."
      ],
      "common_exercises": []
    },
    "Bài 38. Dữ liệu và thu thập dữ liệu": {
      "chapter": "DỮ LIỆU VÀ XÁC SUẤT THỰC NGHIỆM",
      "content": "Làm quen với việc thu thập và biểu diễn dữ liệu qua các loại biểu đồ, và tính xác suất thực nghiệm của sự kiện.",
      "objectives": [
        "Phân biệt dữ liệu là số (số liệu) và dữ liệu không phải là số.",
        "Xác định tính hợp lý của dữ liệu.",
        "Thu thập dữ liệu bằng cách quan sát, lập phiếu hỏi."
      ],
      "common_exercises": []
    },
    "Bài 39. Bảng thống kê và biểu đồ tranh": {
      "chapter": "DỮ LIỆU VÀ XÁC SUẤT THỰC NGHIỆM",
      "content": "Làm quen với việc thu thập và biểu diễn dữ liệu qua các loại biểu đồ, và tính xác suất thực nghiệm của sự kiện.",
      "objectives": [
        "Lập bảng thống kê từ dãy dữ liệu.",
        "Đọc và phân tích dữ liệu từ bảng thống kê, biểu đồ tranh.",
        "Biểu diễn dữ liệu bằng biểu đồ tranh."
      ],
      "common_exercises": []
    },
    "Bài 40. Biểu đồ cột": {
      "chapter": "DỮ LIỆU VÀ XÁC SUẤT THỰC NGHIỆM",
      "content": "Làm quen với việc thu thập và biểu diễn dữ liệu qua các loại biểu đồ, và tính xác suất thực nghiệm của sự kiện.",
      "objectives": [
        "Vẽ biểu đồ cột từ bảng thống kê.",
        "Đọc và phân tích dữ liệu từ biểu đồ cột."
      ],
      "common_exercises": []
    },
    "Bài 41. Biểu đồ cột kép": {
      "chapter": "DỮ LIỆU VÀ XÁC SUẤT THỰC NGHIỆM",
      "content": "Làm quen với việc thu thập và biểu diễn dữ liệu qua các loại biểu đồ, và tính xác suất thực nghiệm của sự kiện.",
      "objectives": [
        "Vẽ biểu đồ cột kép.",
        "Đọc và phân tích dữ liệu từ biểu đồ cột kép để so sánh hai tập dữ liệu."
      ],
      "common_exercises": []
    },
    "Bài 42. Kết quả có thể và sự kiện trong trò chơi, thí nghiệm": {
      "chapter": "DỮ LIỆU VÀ XÁC SUẤT THỰC NGHIỆM",
      "content": "Làm quen với việc thu thập và biểu diễn dữ liệu qua các loại biểu đồ, và tính xác suất thực nghiệm của sự kiện.",
      "objectives": [
        "Liệt kê các kết quả có thể xảy ra trong các trò chơi, thí nghiệm đơn giản.",
        "Nhận biết một sự kiện có xảy ra hay không."
      ],
      "common_exercises": []
    },
    "Bài 43. Xác suất thực nghiệm": {
      "chapter": "DỮ LIỆU VÀ XÁC SUẤT THỰC NGHIỆM",
      "content": "Làm quen với việc thu thập và biểu diễn dữ liệu qua các loại biểu đồ, và tính xác suất thực nghiệm của sự kiện.",
      "objectives": [
        "Tính xác suất thực nghiệm của một sự kiện trong trò chơi, thí nghiệm."
      ],
      "common_exercises": []
    }
  },
  "7": {
    "Bài 1. Tập hợp các số hữu tỉ": {
      "chapter": "SỐ HỮU TỈ",
      "content": "Nghiên cứu tập hợp số hữu tỉ, các phép toán, luỹ thừa và thứ tự thực hiện phép tính.",
      "objectives": [
        "Nhận biết số hữu tỉ, tập hợp các số hữu tỉ.",
        "Tìm số đối của một số hữu tỉ.",
        "Biểu diễn số hữu tỉ trên trục số.",
        "So sánh hai số hữu tỉ."
      ],
      "common_exercises": []
    },
    "Bài 2. Cộng, trừ, nhân, chia số hữu tỉ": {
      "chapter": "SỐ HỮU TỈ",
      "content": "Nghiên cứu tập hợp số hữu tỉ, các phép toán, luỹ thừa và thứ tự thực hiện phép tính.",
      "objectives": [
        "Thực hiện các phép tính cộng, trừ, nhân, chia trong tập hợp số hữu tỉ.",
        "Áp dụng các tính chất của phép toán và quy tắc dấu ngoặc để tính nhanh."
      ],
      "common_exercises": []
    },
    "Bài 3. Luỹ thừa với số mũ tự nhiên của một số hữu tỉ": {
      "chapter": "SỐ HỮU TỈ",
      "content": "Nghiên cứu tập hợp số hữu tỉ, các phép toán, luỹ thừa và thứ tự thực hiện phép tính.",
      "objectives": [
        "Tính giá trị của luỹ thừa với số mũ tự nhiên.",
        "Thực hiện các phép tính nhân, chia hai luỹ thừa cùng cơ số.",
        "Thực hiện phép tính luỹ thừa của một luỹ thừa."
      ],
      "common_exercises": []
    },
    "Bài 4. Thứ tự thực hiện các phép tính. Quy tắc chuyển vế": {
      "chapter": "SỐ HỮU TỈ",
      "content": "Nghiên cứu tập hợp số hữu tỉ, các phép toán, luỹ thừa và thứ tự thực hiện phép tính.",
      "objectives": [
        "Áp dụng đúng thứ tự thực hiện các phép tính trong một biểu thức số hữu tỉ.",
        "Áp dụng quy tắc chuyển vế để tìm x trong một đẳng thức."
      ],
      "common_exercises": []
    },
    "Bài 5. Làm quen với số thập phân vô hạn tuần hoàn": {
      "chapter": "SỐ THỰC",
      "content": "Tìm hiểu về số thập phân vô hạn tuần hoàn, số vô tỉ, căn bậc hai và tập hợp số thực.",
      "objectives": [
        "Nhận biết số thập phân hữu hạn và số thập phân vô hạn tuần hoàn.",
        "Viết gọn số thập phân vô hạn tuần hoàn.",
        "Làm tròn số thập phân căn cứ vào độ chính xác cho trước."
      ],
      "common_exercises": []
    },
    "Bài 6. Số vô tỉ. Căn bậc hai số học": {
      "chapter": "SỐ THỰC",
      "content": "Tìm hiểu về số thập phân vô hạn tuần hoàn, số vô tỉ, căn bậc hai và tập hợp số thực.",
      "objectives": [
        "Nhận biết số vô tỉ.",
        "Tính giá trị đúng hoặc gần đúng của căn bậc hai số học bằng máy tính cầm tay."
      ],
      "common_exercises": []
    },
    "Bài 7. Tập hợp các số thực": {
      "chapter": "SỐ THỰC",
      "content": "Tìm hiểu về số thập phân vô hạn tuần hoàn, số vô tỉ, căn bậc hai và tập hợp số thực.",
      "objectives": [
        "Nhận biết tập hợp các số thực.",
        "Tìm số đối, giá trị tuyệt đối của một số thực.",
        "Biểu diễn số thực trên trục số."
      ],
      "common_exercises": []
    },
    "Bài 8. Góc ở vị trí đặc biệt. Tia phân giác của một góc": {
      "chapter": "GÓC VÀ ĐƯỜNG THẲNG SONG SONG",
      "content": "Nghiên cứu về các loại góc, tia phân giác, hai đường thẳng song song, tiên đề Euclid và định lí.",
      "objectives": [
        "Nhận biết hai góc kề bù, hai góc đối đỉnh.",
        "Tính số đo góc dựa vào tính chất của hai góc kề bù, hai góc đối đỉnh.",
        "Nhận biết và vẽ tia phân giác của một góc."
      ],
      "common_exercises": []
    },
    "Bài 9. Hai đường thẳng song song và dấu hiệu nhận biết": {
      "chapter": "GÓC VÀ ĐƯỜNG THẲNG SONG SONG",
      "content": "Nghiên cứu về các loại góc, tia phân giác, hai đường thẳng song song, tiên đề Euclid và định lí.",
      "objectives": [
        "Nhận biết các cặp góc so le trong, đồng vị, trong cùng phía.",
        "Vận dụng dấu hiệu nhận biết hai đường thẳng song song thông qua cặp góc so le trong hoặc đồng vị bằng nhau."
      ],
      "common_exercises": []
    },
    "Bài 10. Tiên đề Euclid. Tính chất của hai đường thẳng song song": {
      "chapter": "GÓC VÀ ĐƯỜNG THẲNG SONG SONG",
      "content": "Nghiên cứu về các loại góc, tia phân giác, hai đường thẳng song song, tiên đề Euclid và định lí.",
      "objectives": [
        "Phát biểu và vận dụng Tiên đề Euclid.",
        "Áp dụng tính chất của hai đường thẳng song song để tính số đo góc."
      ],
      "common_exercises": []
    },
    "Bài 11. Định lí và chứng minh định lí": {
      "chapter": "GÓC VÀ ĐƯỜNG THẲNG SONG SONG",
      "content": "Nghiên cứu về các loại góc, tia phân giác, hai đường thẳng song song, tiên đề Euclid và định lí.",
      "objectives": [
        "Nhận biết một định lí, giả thiết và kết luận của định lí.",
        "Làm quen với các bước chứng minh một định lí."
      ],
      "common_exercises": []
    },
    "Bài 12. Tổng các góc trong một tam giác": {
      "chapter": "TAM GIÁC BẰNG NHAU",
      "content": "Khảo sát các trường hợp bằng nhau của tam giác thường và tam giác vuông, tam giác cân và đường trung trực.",
      "objectives": [
        "Tính số đo góc chưa biết trong một tam giác.",
        "Nhận biết tam giác nhọn, tam giác vuông, tam giác tù.",
        "Tính số đo góc ngoài của tam giác."
      ],
      "common_exercises": []
    },
    "Bài 13. Hai tam giác bằng nhau. Trường hợp bằng nhau thứ nhất của tam giác": {
      "chapter": "TAM GIÁC BẰNG NHAU",
      "content": "Khảo sát các trường hợp bằng nhau của tam giác thường và tam giác vuông, tam giác cân và đường trung trực.",
      "objectives": [
        "Nhận biết hai tam giác bằng nhau, các cạnh và góc tương ứng.",
        "Chứng minh hai tam giác bằng nhau theo trường hợp cạnh - cạnh - cạnh (c.c.c)."
      ],
      "common_exercises": []
    },
    "Bài 14. Trường hợp bằng nhau thứ hai và thứ ba của tam giác": {
      "chapter": "TAM GIÁC BẰNG NHAU",
      "content": "Khảo sát các trường hợp bằng nhau của tam giác thường và tam giác vuông, tam giác cân và đường trung trực.",
      "objectives": [
        "Chứng minh hai tam giác bằng nhau theo trường hợp cạnh - góc - cạnh (c.g.c).",
        "Chứng minh hai tam giác bằng nhau theo trường hợp góc - cạnh - góc (g.c.g)."
      ],
      "common_exercises": []
    },
    "Bài 15. Các trường hợp bằng nhau của tam giác vuông": {
      "chapter": "TAM GIÁC BẰNG NHAU",
      "content": "Khảo sát các trường hợp bằng nhau của tam giác thường và tam giác vuông, tam giác cân và đường trung trực.",
      "objectives": [
        "Chứng minh hai tam giác vuông bằng nhau theo các trường hợp: hai cạnh góc vuông, cạnh góc vuông - góc nhọn kề, cạnh huyền - góc nhọn, cạnh huyền - cạnh góc vuông."
      ],
      "common_exercises": []
    },
    "Bài 16. Tam giác cân. Đường trung trực của đoạn thẳng": {
      "chapter": "TAM GIÁC BẰNG NHAU",
      "content": "Khảo sát các trường hợp bằng nhau của tam giác thường và tam giác vuông, tam giác cân và đường trung trực.",
      "objectives": [
        "Nhận biết và chứng minh một tam giác là tam giác cân.",
        "Áp dụng tính chất của tam giác cân để tính số đo góc, chứng minh các đoạn thẳng bằng nhau.",
        "Nhận biết và vẽ đường trung trực của một đoạn thẳng."
      ],
      "common_exercises": []
    },
    "Bài 17. Thu thập và phân loại dữ liệu": {
      "chapter": "THU THẬP VÀ BIỂU DIỄN DỮ LIỆU",
      "content": "Tìm hiểu cách thu thập, phân loại dữ liệu và biểu diễn chúng bằng biểu đồ hình quạt tròn, biểu đồ đoạn thẳng.",
      "objectives": [
        "Phân loại dữ liệu là số liệu hoặc không phải là số liệu.",
        "Nhận biết tính đại diện của dữ liệu."
      ],
      "common_exercises": []
    },
    "Bài 18. Biểu đồ hình quạt tròn": {
      "chapter": "THU THẬP VÀ BIỂU DIỄN DỮ LIỆU",
      "content": "Tìm hiểu cách thu thập, phân loại dữ liệu và biểu diễn chúng bằng biểu đồ hình quạt tròn, biểu đồ đoạn thẳng.",
      "objectives": [
        "Đọc và mô tả dữ liệu từ biểu đồ hình quạt tròn.",
        "Biểu diễn dữ liệu vào biểu đồ hình quạt tròn."
      ],
      "common_exercises": []
    },
    "Bài 19. Biểu đồ đoạn thẳng": {
      "chapter": "THU THẬP VÀ BIỂU DIỄN DỮ LIỆU",
      "content": "Tìm hiểu cách thu thập, phân loại dữ liệu và biểu diễn chúng bằng biểu đồ hình quạt tròn, biểu đồ đoạn thẳng.",
      "objectives": [
        "Đọc và mô tả dữ liệu từ biểu đồ đoạn thẳng.",
        "Vẽ biểu đồ đoạn thẳng."
      ],
      "common_exercises": []
    },
    "Bài 20. Tỉ lệ thức": {
      "chapter": "TỈ LỆ THỨC VÀ ĐẠI LƯỢNG TỈ LỆ",
      "content": "Nghiên cứu về tỉ lệ thức, dãy tỉ số bằng nhau và các đại lượng tỉ lệ thuận, tỉ lệ nghịch.",
      "objectives": [
        "Lập tỉ lệ thức từ các tỉ số bằng nhau.",
        "Áp dụng tính chất của tỉ lệ thức (tính chất cơ bản và tính chất hoán vị) để tìm thành phần chưa biết."
      ],
      "common_exercises": []
    },
    "Bài 21. Tính chất của dãy tỉ số bằng nhau": {
      "chapter": "TỈ LỆ THỨC VÀ ĐẠI LƯỢNG TỈ LỆ",
      "content": "Nghiên cứu về tỉ lệ thức, dãy tỉ số bằng nhau và các đại lượng tỉ lệ thuận, tỉ lệ nghịch.",
      "objectives": [
        "Áp dụng tính chất của dãy tỉ số bằng nhau để giải các bài toán chia tỉ lệ."
      ],
      "common_exercises": []
    },
    "Bài 22. Đại lượng tỉ lệ thuận": {
      "chapter": "TỈ LỆ THỨC VÀ ĐẠI LƯỢNG TỈ LỆ",
      "content": "Nghiên cứu về tỉ lệ thức, dãy tỉ số bằng nhau và các đại lượng tỉ lệ thuận, tỉ lệ nghịch.",
      "objectives": [
        "Nhận biết hai đại lượng tỉ lệ thuận.",
        "Giải các bài toán về đại lượng tỉ lệ thuận."
      ],
      "common_exercises": []
    },
    "Bài 23. Đại lượng tỉ lệ nghịch": {
      "chapter": "TỈ LỆ THỨC VÀ ĐẠI LƯỢNG TỈ LỆ",
      "content": "Nghiên cứu về tỉ lệ thức, dãy tỉ số bằng nhau và các đại lượng tỉ lệ thuận, tỉ lệ nghịch.",
      "objectives": [
        "Nhận biết hai đại lượng tỉ lệ nghịch.",
        "Giải các bài toán về đại lượng tỉ lệ nghịch."
      ],
      "common_exercises": []
    },
    "Bài 24. Biểu thức đại số": {
      "chapter": "BIỂU THỨC ĐẠI SỐ VÀ ĐA THỨC MỘT BIẾN",
      "content": "Làm quen với biểu thức đại số, đa thức một biến và các phép toán cộng, trừ, nhân, chia đa thức.",
      "objectives": [
        "Nhận biết biểu thức số, biểu thức đại số.",
        "Tính giá trị của một biểu thức đại số."
      ],
      "common_exercises": []
    },
    "Bài 25. Đa thức một biến": {
      "chapter": "BIỂU THỨC ĐẠI SỐ VÀ ĐA THỨC MỘT BIẾN",
      "content": "Làm quen với biểu thức đại số, đa thức một biến và các phép toán cộng, trừ, nhân, chia đa thức.",
      "objectives": [
        "Nhận biết đơn thức, đa thức một biến.",
        "Thu gọn và sắp xếp đa thức một biến.",
        "Xác định bậc, hệ số cao nhất, hệ số tự do của đa thức.",
        "Nhận biết nghiệm của đa thức một biến."
      ],
      "common_exercises": []
    },
    "Bài 26. Phép cộng và phép trừ đa thức một biến": {
      "chapter": "BIỂU THỨC ĐẠI SỐ VÀ ĐA THỨC MỘT BIẾN",
      "content": "Làm quen với biểu thức đại số, đa thức một biến và các phép toán cộng, trừ, nhân, chia đa thức.",
      "objectives": [
        "Thực hiện phép cộng và trừ đa thức một biến theo hàng ngang hoặc cột dọc."
      ],
      "common_exercises": []
    },
    "Bài 27. Phép nhân đa thức một biến": {
      "chapter": "BIỂU THỨC ĐẠI SỐ VÀ ĐA THỨC MỘT BIẾN",
      "content": "Làm quen với biểu thức đại số, đa thức một biến và các phép toán cộng, trừ, nhân, chia đa thức.",
      "objectives": [
        "Thực hiện phép nhân đơn thức với đa thức.",
        "Thực hiện phép nhân hai đa thức một biến."
      ],
      "common_exercises": []
    },
    "Bài 28. Phép chia đa thức một biến": {
      "chapter": "BIỂU THỨC ĐẠI SỐ VÀ ĐA THỨC MỘT BIẾN",
      "content": "Làm quen với biểu thức đại số, đa thức một biến và các phép toán cộng, trừ, nhân, chia đa thức.",
      "objectives": [
        "Thực hiện phép chia đa thức cho đơn thức (trường hợp chia hết).",
        "Thực hiện phép chia đa thức cho đa thức (chia hết và chia có dư)."
      ],
      "common_exercises": []
    },
    "Bài 29. Làm quen với biến cố": {
      "chapter": "LÀM QUEN VỚI BIẾN CỐ VÀ XÁC SUẤT CỦA BIẾN CỐ",
      "content": "Giới thiệu các khái niệm về biến cố (chắc chắn, không thể, ngẫu nhiên) và cách tính xác suất của biến cố.",
      "objectives": [
        "Phân biệt biến cố chắc chắn, biến cố không thể, biến cố ngẫu nhiên."
      ],
      "common_exercises": []
    },
    "Bài 30. Làm quen với xác suất của biến cố": {
      "chapter": "LÀM QUEN VỚI BIẾN CỐ VÀ XÁC SUẤT CỦA BIẾN CỐ",
      "content": "Giới thiệu các khái niệm về biến cố (chắc chắn, không thể, ngẫu nhiên) và cách tính xác suất của biến cố.",
      "objectives": [
        "Tính xác suất của một biến cố trong các trò chơi, thí nghiệm đơn giản có các kết quả đồng khả năng."
      ],
      "common_exercises": []
    },
    "Bài 31. Quan hệ giữa góc và cạnh đối diện trong một tam giác": {
      "chapter": "QUAN HỆ GIỮA CÁC YẾU TỐ TRONG MỘT TAM GIÁC",
      "content": "Nghiên cứu các quan hệ về góc và cạnh, đường vuông góc, đường xiên, bất đẳng thức tam giác và sự đồng quy của các đường đặc biệt.",
      "objectives": [
        "So sánh các góc của một tam giác khi biết độ dài các cạnh.",
        "So sánh các cạnh của một tam giác khi biết số đo các góc."
      ],
      "common_exercises": []
    },
    "Bài 32. Quan hệ giữa đường vuông góc và đường xiên": {
      "chapter": "QUAN HỆ GIỮA CÁC YẾU TỐ TRONG MỘT TAM GIÁC",
      "content": "Nghiên cứu các quan hệ về góc và cạnh, đường vuông góc, đường xiên, bất đẳng thức tam giác và sự đồng quy của các đường đặc biệt.",
      "objectives": [
        "So sánh đường vuông góc và đường xiên.",
        "Xác định khoảng cách từ một điểm đến một đường thẳng."
      ],
      "common_exercises": []
    },
    "Bài 33. Quan hệ giữa ba cạnh của một tam giác": {
      "chapter": "QUAN HỆ GIỮA CÁC YẾU TỐ TRONG MỘT TAM GIÁC",
      "content": "Nghiên cứu các quan hệ về góc và cạnh, đường vuông góc, đường xiên, bất đẳng thức tam giác và sự đồng quy của các đường đặc biệt.",
      "objectives": [
        "Kiểm tra một bộ ba độ dài có phải là ba cạnh của một tam giác hay không bằng cách sử dụng bất đẳng thức tam giác."
      ],
      "common_exercises": []
    },
    "Bài 34. Sự đồng quy của ba đường trung tuyến, ba đường phân giác trong một tam giác": {
      "chapter": "QUAN HỆ GIỮA CÁC YẾU TỐ TRONG MỘT TAM GIÁC",
      "content": "Nghiên cứu các quan hệ về góc và cạnh, đường vuông góc, đường xiên, bất đẳng thức tam giác và sự đồng quy của các đường đặc biệt.",
      "objectives": [
        "Nhận biết đường trung tuyến, trọng tâm của tam giác và áp dụng tính chất trọng tâm.",
        "Nhận biết đường phân giác của tam giác và tính chất đồng quy của ba đường phân giác."
      ],
      "common_exercises": []
    },
    "Bài 35. Sự đồng quy của ba đường trung trực, ba đường cao trong một tam giác": {
      "chapter": "QUAN HỆ GIỮA CÁC YẾU TỐ TRONG MỘT TAM GIÁC",
      "content": "Nghiên cứu các quan hệ về góc và cạnh, đường vuông góc, đường xiên, bất đẳng thức tam giác và sự đồng quy của các đường đặc biệt.",
      "objectives": [
        "Nhận biết đường trung trực, đường cao của tam giác.",
        "Nhận biết tính chất đồng quy của ba đường trung trực, ba đường cao."
      ],
      "common_exercises": []
    },
    "Bài 36. Hình hộp chữ nhật và hình lập phương": {
      "chapter": "MỘT SỐ HÌNH KHỐI TRONG THỰC TIỄN",
      "content": "Mô tả và tính toán diện tích xung quanh, thể tích của các hình khối như hình hộp chữ nhật, lập phương và lăng trụ đứng.",
      "objectives": [
        "Mô tả các yếu tố (đỉnh, cạnh, mặt, đường chéo) của hình hộp chữ nhật, hình lập phương.",
        "Tính diện tích xung quanh và thể tích của hình hộp chữ nhật, hình lập phương."
      ],
      "common_exercises": []
    },
    "Bài 37. Hình lăng trụ đứng tam giác và hình lăng trụ đứng tứ giác": {
      "chapter": "MỘT SỐ HÌNH KHỐI TRONG THỰC TIỄN",
      "content": "Mô tả và tính toán diện tích xung quanh, thể tích của các hình khối như hình hộp chữ nhật, lập phương và lăng trụ đứng.",
      "objectives": [
        "Mô tả các yếu tố của hình lăng trụ đứng tam giác, hình lăng trụ đứng tứ giác.",
        "Tính diện tích xung quanh và thể tích của hình lăng trụ đứng tam giác, hình lăng trụ đứng tứ giác."
      ],
      "common_exercises": []
    }
  },
  "8": {
    "Bài 1. Đơn thức": {
      "chapter": "ĐA THỨC",
      "content": "Nghiên cứu về đơn thức, đa thức nhiều biến và các phép toán cộng, trừ, nhân, chia đa thức.",
      "objectives": [
        "Nhận biết đơn thức, đơn thức thu gọn.",
        "Xác định hệ số, phần biến, bậc của đơn thức.",
        "Thực hiện cộng, trừ các đơn thức đồng dạng."
      ],
      "common_exercises": []
    },
    "Bài 2. Đa thức": {
      "chapter": "ĐA THỨC",
      "content": "Nghiên cứu về đơn thức, đa thức nhiều biến và các phép toán cộng, trừ, nhân, chia đa thức.",
      "objectives": [
        "Nhận biết đa thức, hạng tử của đa thức.",
        "Thu gọn đa thức và xác định bậc của đa thức.",
        "Tính giá trị của đa thức khi biết giá trị của các biến."
      ],
      "common_exercises": []
    },
    "Bài 3. Phép cộng và phép trừ đa thức": {
      "chapter": "ĐA THỨC",
      "content": "Nghiên cứu về đơn thức, đa thức nhiều biến và các phép toán cộng, trừ, nhân, chia đa thức.",
      "objectives": [
        "Thực hiện phép cộng và trừ hai đa thức nhiều biến."
      ],
      "common_exercises": []
    },
    "Bài 4. Phép nhân đa thức": {
      "chapter": "ĐA THỨC",
      "content": "Nghiên cứu về đơn thức, đa thức nhiều biến và các phép toán cộng, trừ, nhân, chia đa thức.",
      "objectives": [
        "Thực hiện phép nhân đơn thức với đa thức.",
        "Thực hiện phép nhân hai đa thức."
      ],
      "common_exercises": []
    },
    "Bài 5. Phép chia đa thức cho đơn thức": {
      "chapter": "ĐA THỨC",
      "content": "Nghiên cứu về đơn thức, đa thức nhiều biến và các phép toán cộng, trừ, nhân, chia đa thức.",
      "objectives": [
        "Thực hiện phép chia đơn thức cho đơn thức (trường hợp chia hết).",
        "Thực hiện phép chia đa thức cho đơn thức (trường hợp chia hết)."
      ],
      "common_exercises": []
    },
    "Bài 6. Hiệu hai bình phương. Bình phương của một tổng hay một hiệu": {
      "chapter": "HẰNG ĐẲNG THỨC ĐÁNG NHỚ VÀ ỨNG DỤNG",
      "content": "Tìm hiểu và vận dụng các hằng đẳng thức đáng nhớ để khai triển, rút gọn và phân tích đa thức thành nhân tử.",
      "objectives": [
        "Khai triển hằng đẳng thức bình phương của một tổng, một hiệu.",
        "Viết biểu thức dưới dạng tích bằng hằng đẳng thức hiệu hai bình phương.",
        "Áp dụng hằng đẳng thức để tính nhanh."
      ],
      "common_exercises": []
    },
    "Bài 7. Lập phương của một tổng hay một hiệu": {
      "chapter": "HẰNG ĐẲNG THỨC ĐÁNG NHỚ VÀ ỨNG DỤNG",
      "content": "Tìm hiểu và vận dụng các hằng đẳng thức đáng nhớ để khai triển, rút gọn và phân tích đa thức thành nhân tử.",
      "objectives": [
        "Khai triển hằng đẳng thức lập phương của một tổng, một hiệu.",
        "Viết biểu thức dưới dạng lập phương của một tổng hoặc một hiệu."
      ],
      "common_exercises": []
    },
    "Bài 8. Tổng và hiệu hai lập phương": {
      "chapter": "HẰNG ĐẲNG THỨC ĐÁNG NHỚ VÀ ỨNG DỤNG",
      "content": "Tìm hiểu và vận dụng các hằng đẳng thức đáng nhớ để khai triển, rút gọn và phân tích đa thức thành nhân tử.",
      "objectives": [
        "Viết biểu thức dưới dạng tích bằng hằng đẳng thức tổng hoặc hiệu hai lập phương."
      ],
      "common_exercises": []
    },
    "Bài 9. Phân tích đa thức thành nhân tử": {
      "chapter": "HẰNG ĐẲNG THỨC ĐÁNG NHỚ VÀ ỨNG DỤNG",
      "content": "Tìm hiểu và vận dụng các hằng đẳng thức đáng nhớ để khai triển, rút gọn và phân tích đa thức thành nhân tử.",
      "objectives": [
        "Phân tích đa thức thành nhân tử bằng phương pháp đặt nhân tử chung.",
        "Phân tích đa thức thành nhân tử bằng phương pháp nhóm hạng tử.",
        "Phân tích đa thức thành nhân tử bằng cách sử dụng hằng đẳng thức.",
        "Phối hợp các phương pháp để phân tích đa thức thành nhân tử."
      ],
      "common_exercises": []
    },
    "Bài 10. Tứ giác": {
      "chapter": "TỨ GIÁC",
      "content": "Khảo sát các loại tứ giác đặc biệt như hình thang cân, hình bình hành, hình chữ nhật, hình thoi và hình vuông, bao gồm tính chất và dấu hiệu nhận biết.",
      "objectives": [
        "Nhận biết tứ giác, tứ giác lồi, các yếu tố (đỉnh, cạnh, góc, đường chéo) của tứ giác.",
        "Tính số đo góc chưa biết trong một tứ giác."
      ],
      "common_exercises": []
    },
    "Bài 11. Hình thang cân": {
      "chapter": "TỨ GIÁC",
      "content": "Khảo sát các loại tứ giác đặc biệt như hình thang cân, hình bình hành, hình chữ nhật, hình thoi và hình vuông, bao gồm tính chất và dấu hiệu nhận biết.",
      "objectives": [
        "Nhận biết hình thang, hình thang cân.",
        "Áp dụng các tính chất về cạnh bên và đường chéo của hình thang cân.",
        "Vận dụng dấu hiệu nhận biết để chứng minh một hình thang là hình thang cân."
      ],
      "common_exercises": []
    },
    "Bài 12. Hình bình hành": {
      "chapter": "TỨ GIÁC",
      "content": "Khảo sát các loại tứ giác đặc biệt như hình thang cân, hình bình hành, hình chữ nhật, hình thoi và hình vuông, bao gồm tính chất và dấu hiệu nhận biết.",
      "objectives": [
        "Mô tả và áp dụng các tính chất của hình bình hành (về cạnh, góc, đường chéo).",
        "Vận dụng các dấu hiệu nhận biết để chứng minh một tứ giác là hình bình hành."
      ],
      "common_exercises": []
    },
    "Bài 13. Hình chữ nhật": {
      "chapter": "TỨ GIÁC",
      "content": "Khảo sát các loại tứ giác đặc biệt như hình thang cân, hình bình hành, hình chữ nhật, hình thoi và hình vuông, bao gồm tính chất và dấu hiệu nhận biết.",
      "objectives": [
        "Mô tả và áp dụng các tính chất của hình chữ nhật.",
        "Vận dụng các dấu hiệu nhận biết để chứng minh một tứ giác là hình chữ nhật."
      ],
      "common_exercises": []
    },
    "Bài 14. Hình thoi và hình vuông": {
      "chapter": "TỨ GIÁC",
      "content": "Khảo sát các loại tứ giác đặc biệt như hình thang cân, hình bình hành, hình chữ nhật, hình thoi và hình vuông, bao gồm tính chất và dấu hiệu nhận biết.",
      "objectives": [
        "Mô tả và áp dụng các tính chất của hình thoi, hình vuông.",
        "Vận dụng các dấu hiệu nhận biết để chứng minh một tứ giác là hình thoi, hình vuông."
      ],
      "common_exercises": []
    },
    "Bài 15. Định lí Thalès trong tam giác": {
      "chapter": "ĐỊNH LÍ THALÈS",
      "content": "Nghiên cứu và áp dụng định lí Thalès, đường trung bình của tam giác và tính chất đường phân giác.",
      "objectives": [
        "Áp dụng định lí Thalès thuận để tính độ dài đoạn thẳng.",
        "Áp dụng định lí Thalès đảo để chứng minh hai đường thẳng song song."
      ],
      "common_exercises": []
    },
    "Bài 16. Đường trung bình của tam giác": {
      "chapter": "ĐỊNH LÍ THALÈS",
      "content": "Nghiên cứu và áp dụng định lí Thalès, đường trung bình của tam giác và tính chất đường phân giác.",
      "objectives": [
        "Nhận biết và áp dụng tính chất đường trung bình của tam giác để tính độ dài đoạn thẳng và chứng minh song song."
      ],
      "common_exercises": []
    },
    "Bài 17. Tính chất đường phân giác của tam giác": {
      "chapter": "ĐỊNH LÍ THALÈS",
      "content": "Nghiên cứu và áp dụng định lí Thalès, đường trung bình của tam giác và tính chất đường phân giác.",
      "objectives": [
        "Áp dụng tính chất đường phân giác trong của tam giác để tính độ dài đoạn thẳng và tỉ số."
      ],
      "common_exercises": []
    },
    "Bài 18. Thu thập và phân loại dữ liệu": {
      "chapter": "DỮ LIỆU VÀ BIỂU ĐỒ",
      "content": "Học cách thu thập, phân loại dữ liệu và biểu diễn, phân tích số liệu thống kê qua các loại biểu đồ.",
      "objectives": [
        "Phân loại số liệu là rời rạc hay liên tục.",
        "Lựa chọn phương pháp thu thập dữ liệu phù hợp."
      ],
      "common_exercises": []
    },
    "Bài 19. Biểu diễn dữ liệu bằng bảng, biểu đồ": {
      "chapter": "DỮ LIỆU VÀ BIỂU ĐỒ",
      "content": "Học cách thu thập, phân loại dữ liệu và biểu diễn, phân tích số liệu thống kê qua các loại biểu đồ.",
      "objectives": [
        "Lựa chọn biểu đồ tranh, biểu đồ cột hoặc biểu đồ đoạn thẳng để biểu diễn dữ liệu.",
        "Chuyển dữ liệu từ bảng sang biểu đồ và ngược lại."
      ],
      "common_exercises": []
    },
    "Bài 20. Phân tích số liệu thống kê dựa vào biểu đồ": {
      "chapter": "DỮ LIỆU VÀ BIỂU ĐỒ",
      "content": "Học cách thu thập, phân loại dữ liệu và biểu diễn, phân tích số liệu thống kê qua các loại biểu đồ.",
      "objectives": [
        "Phân tích số liệu thống kê từ biểu đồ để rút ra kết luận.",
        "Nhận biết tính hợp lý của dữ liệu được biểu diễn."
      ],
      "common_exercises": []
    },
    "Bài 21. Phân thức đại số": {
      "chapter": "PHÂN THỨC ĐẠI SỐ",
      "content": "Nghiên cứu về phân thức đại số, các tính chất và các phép toán cộng, trừ, nhân, chia phân thức.",
      "objectives": [
        "Nhận biết phân thức đại số.",
        "Viết điều kiện xác định của phân thức.",
        "Tính giá trị của phân thức tại một giá trị cho trước của biến."
      ],
      "common_exercises": []
    },
    "Bài 22. Tính chất cơ bản của phân thức đại số": {
      "chapter": "PHÂN THỨC ĐẠI SỐ",
      "content": "Nghiên cứu về phân thức đại số, các tính chất và các phép toán cộng, trừ, nhân, chia phân thức.",
      "objectives": [
        "Áp dụng tính chất cơ bản để rút gọn phân thức đại số.",
        "Quy đồng mẫu thức nhiều phân thức."
      ],
      "common_exercises": []
    },
    "Bài 23. Phép cộng và phép trừ phân thức đại số": {
      "chapter": "PHÂN THỨC ĐẠI SỐ",
      "content": "Nghiên cứu về phân thức đại số, các tính chất và các phép toán cộng, trừ, nhân, chia phân thức.",
      "objectives": [
        "Thực hiện phép cộng và trừ các phân thức đại số (cùng mẫu, khác mẫu)."
      ],
      "common_exercises": []
    },
    "Bài 24. Phép nhân và phép chia phân thức đại số": {
      "chapter": "PHÂN THỨC ĐẠI SỐ",
      "content": "Nghiên cứu về phân thức đại số, các tính chất và các phép toán cộng, trừ, nhân, chia phân thức.",
      "objectives": [
        "Thực hiện phép nhân và chia các phân thức đại số."
      ],
      "common_exercises": []
    },
    "Bài 25. Phương trình bậc nhất một ẩn": {
      "chapter": "PHƯƠNG TRÌNH BẬC NHẤT VÀ HÀM SỐ BẬC NHẤT",
      "content": "Giải phương trình bậc nhất, giải toán bằng cách lập phương trình và tìm hiểu về hàm số bậc nhất, đồ thị của nó.",
      "objectives": [
        "Nhận biết và giải phương trình bậc nhất một ẩn.",
        "Giải các phương trình đưa được về dạng ax + b = 0."
      ],
      "common_exercises": []
    },
    "Bài 26. Giải bài toán bằng cách lập phương trình": {
      "chapter": "PHƯƠNG TRÌNH BẬC NHẤT VÀ HÀM SỐ BẬC NHẤT",
      "content": "Giải phương trình bậc nhất, giải toán bằng cách lập phương trình và tìm hiểu về hàm số bậc nhất, đồ thị của nó.",
      "objectives": [
        "Giải các bài toán thực tế (toán chuyển động, toán năng suất, toán phần trăm...) bằng cách lập phương trình bậc nhất một ẩn."
      ],
      "common_exercises": []
    },
    "Bài 27. Khái niệm hàm số và đồ thị của hàm số": {
      "chapter": "PHƯƠNG TRÌNH BẬC NHẤT VÀ HÀM SỐ BẬC NHẤT",
      "content": "Giải phương trình bậc nhất, giải toán bằng cách lập phương trình và tìm hiểu về hàm số bậc nhất, đồ thị của nó.",
      "objectives": [
        "Nhận biết khái niệm hàm số.",
        "Tính giá trị của hàm số khi cho bởi công thức.",
        "Xác định toạ độ của một điểm và xác định điểm trên mặt phẳng toạ độ.",
        "Vẽ đồ thị của hàm số cho bởi bảng giá trị."
      ],
      "common_exercises": []
    },
    "Bài 28. Hàm số bậc nhất và đồ thị của hàm số bậc nhất": {
      "chapter": "PHƯƠNG TRÌNH BẬC NHẤT VÀ HÀM SỐ BẬC NHẤT",
      "content": "Giải phương trình bậc nhất, giải toán bằng cách lập phương trình và tìm hiểu về hàm số bậc nhất, đồ thị của nó.",
      "objectives": [
        "Nhận biết hàm số bậc nhất.",
        "Vẽ đồ thị của hàm số bậc nhất y = ax + b."
      ],
      "common_exercises": []
    },
    "Bài 29. Hệ số góc của đường thẳng": {
      "chapter": "PHƯƠNG TRÌNH BẬC NHẤT VÀ HÀM SỐ BẬC NHẤT",
      "content": "Giải phương trình bậc nhất, giải toán bằng cách lập phương trình và tìm hiểu về hàm số bậc nhất, đồ thị của nó.",
      "objectives": [
        "Nhận biết hệ số góc của đường thẳng y = ax + b.",
        "Sử dụng hệ số góc để xét vị trí tương đối (song song, cắt nhau) của hai đường thẳng."
      ],
      "common_exercises": []
    },
    "Bài 30. Kết quả có thể và kết quả thuận lợi": {
      "chapter": "MỞ ĐẦU VỀ TÍNH XÁC SUẤT CỦA BIẾN CỐ",
      "content": "Làm quen với các kết quả có thể, kết quả thuận lợi và cách tính xác suất của biến cố bằng tỉ số.",
      "objectives": [
        "Xác định các kết quả có thể của một hành động, thực nghiệm.",
        "Xác định các kết quả thuận lợi cho một biến cố."
      ],
      "common_exercises": []
    },
    "Bài 31. Cách tính xác suất của biến cố bằng tỉ số": {
      "chapter": "MỞ ĐẦU VỀ TÍNH XÁC SUẤT CỦA BIẾN CỐ",
      "content": "Làm quen với các kết quả có thể, kết quả thuận lợi và cách tính xác suất của biến cố bằng tỉ số.",
      "objectives": [
        "Tính xác suất của một biến cố bằng tỉ số giữa số kết quả thuận lợi và tổng số kết quả có thể (trường hợp đồng khả năng)."
      ],
      "common_exercises": []
    },
    "Bài 32. Mối liên hệ giữa xác suất thực nghiệm với xác suất và ứng dụng": {
      "chapter": "MỞ ĐẦU VỀ TÍNH XÁC SUẤT CỦA BIẾN CỐ",
      "content": "Làm quen với các kết quả có thể, kết quả thuận lợi và cách tính xác suất của biến cố bằng tỉ số.",
      "objectives": [
        "Tính xác suất thực nghiệm của một biến cố.",
        "Ước lượng xác suất của một biến cố bằng xác suất thực nghiệm."
      ],
      "common_exercises": []
    },
    "Bài 33. Hai tam giác đồng dạng": {
      "chapter": "TAM GIÁC ĐỒNG DẠNG",
      "content": "Nghiên cứu các trường hợp đồng dạng của tam giác thường và tam giác vuông, định lí Pythagore và các hình đồng dạng.",
      "objectives": [
        "Nhận biết hai tam giác đồng dạng, tỉ số đồng dạng.",
        "Áp dụng định lí về tam giác đồng dạng (đường thẳng song song với một cạnh)."
      ],
      "common_exercises": []
    },
    "Bài 34. Ba trường hợp đồng dạng của hai tam giác": {
      "chapter": "TAM GIÁC ĐỒNG DẠNG",
      "content": "Nghiên cứu các trường hợp đồng dạng của tam giác thường và tam giác vuông, định lí Pythagore và các hình đồng dạng.",
      "objectives": [
        "Chứng minh hai tam giác đồng dạng theo trường hợp cạnh - cạnh - cạnh (c.c.c).",
        "Chứng minh hai tam giác đồng dạng theo trường hợp cạnh - góc - cạnh (c.g.c).",
        "Chứng minh hai tam giác đồng dạng theo trường hợp góc - góc (g.g)."
      ],
      "common_exercises": []
    },
    "Bài 35. Định lí Pythagore và ứng dụng": {
      "chapter": "TAM GIÁC ĐỒNG DẠNG",
      "content": "Nghiên cứu các trường hợp đồng dạng của tam giác thường và tam giác vuông, định lí Pythagore và các hình đồng dạng.",
      "objectives": [
        "Áp dụng định lí Pythagore thuận và đảo để tính độ dài cạnh và kiểm tra tam giác vuông."
      ],
      "common_exercises": []
    },
    "Bài 36. Các trường hợp đồng dạng của hai tam giác vuông": {
      "chapter": "TAM GIÁC ĐỒNG DẠNG",
      "content": "Nghiên cứu các trường hợp đồng dạng của tam giác thường và tam giác vuông, định lí Pythagore và các hình đồng dạng.",
      "objectives": [
        "Áp dụng các trường hợp đồng dạng của tam giác vuông để giải toán."
      ],
      "common_exercises": []
    },
    "Bài 37. Hình đồng dạng": {
      "chapter": "TAM GIÁC ĐỒNG DẠNG",
      "content": "Nghiên cứu các trường hợp đồng dạng của tam giác thường và tam giác vuông, định lí Pythagore và các hình đồng dạng.",
      "objectives": [
        "Nhận biết các hình đồng dạng trong thực tế."
      ],
      "common_exercises": []
    },
    "Bài 38. Hình chóp tam giác đều": {
      "chapter": "MỘT SỐ HÌNH KHỐI TRONG THỰC TIỄN",
      "content": "Mô tả và tính toán diện tích xung quanh, thể tích của hình chóp tam giác đều và hình chóp tứ giác đều.",
      "objectives": [
        "Mô tả hình chóp tam giác đều.",
        "Tính diện tích xung quanh và thể tích của hình chóp tam giác đều."
      ],
      "common_exercises": []
    },
    "Bài 39. Hình chóp tứ giác đều": {
      "chapter": "MỘT SỐ HÌNH KHỐI TRONG THỰC TIỄN",
      "content": "Mô tả và tính toán diện tích xung quanh, thể tích của hình chóp tam giác đều và hình chóp tứ giác đều.",
      "objectives": [
        "Mô tả hình chóp tứ giác đều.",
        "Tính diện tích xung quanh và thể tích của hình chóp tứ giác đều."
      ],
      "common_exercises": []
    }
  },
  "9": {
    "Bài 1. Khái niệm phương trình và hệ hai phương trình bậc nhất hai ẩn": {
      "chapter": "PHƯƠNG TRÌNH VÀ HỆ HAI PHƯƠNG TRÌNH BẬC NHẤT HAI ẨN",
      "content": "Giải hệ hai phương trình bậc nhất hai ẩn bằng phương pháp thế, cộng đại số và giải toán bằng cách lập hệ phương trình.",
      "objectives": [
        "Nhận biết phương trình và hệ hai phương trình bậc nhất hai ẩn.",
        "Kiểm tra một cặp số có phải là nghiệm của phương trình hoặc hệ phương trình hay không."
      ],
      "common_exercises": []
    },
    "Bài 2. Giải hệ hai phương trình bậc nhất hai ẩn": {
      "chapter": "PHƯƠNG TRÌNH VÀ HỆ HAI PHƯƠNG TRÌNH BẬC NHẤT HAI ẨN",
      "content": "Giải hệ hai phương trình bậc nhất hai ẩn bằng phương pháp thế, cộng đại số và giải toán bằng cách lập hệ phương trình.",
      "objectives": [
        "Giải hệ hai phương trình bậc nhất hai ẩn bằng phương pháp thế.",
        "Giải hệ hai phương trình bậc nhất hai ẩn bằng phương pháp cộng đại số."
      ],
      "common_exercises": []
    },
    "Bài 3. Giải bài toán bằng cách lập hệ phương trình": {
      "chapter": "PHƯƠNG TRÌNH VÀ HỆ HAI PHƯƠNG TRÌNH BẬC NHẤT HAI ẨN",
      "content": "Giải hệ hai phương trình bậc nhất hai ẩn bằng phương pháp thế, cộng đại số và giải toán bằng cách lập hệ phương trình.",
      "objectives": [
        "Giải các bài toán thực tế bằng cách lập hệ hai phương trình bậc nhất hai ẩn."
      ],
      "common_exercises": []
    },
    "Bài 4. Phương trình quy về phương trình bậc nhất một ẩn": {
      "chapter": "PHƯƠNG TRÌNH VÀ BẤT PHƯƠNG TRÌNH BẬC NHẤT MỘT ẨN",
      "content": "Giải các phương trình quy về bậc nhất, phương trình tích, phương trình chứa ẩn ở mẫu và giải bất phương trình bậc nhất một ẩn.",
      "objectives": [
        "Giải phương trình tích.",
        "Giải phương trình chứa ẩn ở mẫu."
      ],
      "common_exercises": []
    },
    "Bài 5. Bất đẳng thức và tính chất": {
      "chapter": "PHƯƠNG TRÌNH VÀ BẤT PHƯƠNG TRÌNH BẬC NHẤT MỘT ẨN",
      "content": "Giải các phương trình quy về bậc nhất, phương trình tích, phương trình chứa ẩn ở mẫu và giải bất phương trình bậc nhất một ẩn.",
      "objectives": [
        "Nhận biết và viết các bất đẳng thức.",
        "Áp dụng tính chất liên hệ giữa thứ tự và phép cộng, phép nhân để so sánh."
      ],
      "common_exercises": []
    },
    "Bài 6. Bất phương trình bậc nhất một ẩn": {
      "chapter": "PHƯƠNG TRÌNH VÀ BẤT PHƯƠNG TRÌNH BẬC NHẤT MỘT ẨN",
      "content": "Giải các phương trình quy về bậc nhất, phương trình tích, phương trình chứa ẩn ở mẫu và giải bất phương trình bậc nhất một ẩn.",
      "objectives": [
        "Giải bất phương trình bậc nhất một ẩn và các bất phương trình đưa được về dạng này."
      ],
      "common_exercises": []
    },
    "Bài 7. Căn bậc hai và căn thức bậc hai": {
      "chapter": "CĂN BẬC HAI VÀ CĂN BẬC BA",
      "content": "Nghiên cứu về căn bậc hai, căn bậc ba và các phép biến đổi, rút gọn biểu thức chứa căn thức.",
      "objectives": [
        "Tìm căn bậc hai của một số không âm.",
        "Tìm điều kiện xác định của một căn thức bậc hai.",
        "Áp dụng hằng đẳng thức √A² = |A| để rút gọn biểu thức."
      ],
      "common_exercises": []
    },
    "Bài 8. Khai căn bậc hai với phép nhân và phép chia": {
      "chapter": "CĂN BẬC HAI VÀ CĂN BẬC BA",
      "content": "Nghiên cứu về căn bậc hai, căn bậc ba và các phép biến đổi, rút gọn biểu thức chứa căn thức.",
      "objectives": [
        "Áp dụng quy tắc khai phương một tích, một thương.",
        "Áp dụng quy tắc nhân, chia các căn bậc hai."
      ],
      "common_exercises": []
    },
    "Bài 9. Biến đổi đơn giản và rút gọn biểu thức chứa căn thức bậc hai": {
      "chapter": "CĂN BẬC HAI VÀ CĂN BẬC BA",
      "content": "Nghiên cứu về căn bậc hai, căn bậc ba và các phép biến đổi, rút gọn biểu thức chứa căn thức.",
      "objectives": [
        "Thực hiện phép biến đổi đưa thừa số ra ngoài/vào trong dấu căn.",
        "Thực hiện phép biến đổi khử mẫu của biểu thức lấy căn.",
        "Thực hiện phép biến đổi trục căn thức ở mẫu."
      ],
      "common_exercises": []
    },
    "Bài 10. Căn bậc ba và căn thức bậc ba": {
      "chapter": "CĂN BẬC HAI VÀ CĂN BẬC BA",
      "content": "Nghiên cứu về căn bậc hai, căn bậc ba và các phép biến đổi, rút gọn biểu thức chứa căn thức.",
      "objectives": [
        "Tính căn bậc ba của một số.",
        "Rút gọn biểu thức chứa căn thức bậc ba."
      ],
      "common_exercises": []
    },
    "Bài 11. Tỉ số lượng giác của góc nhọn": {
      "chapter": "HỆ THỨC LƯỢNG TRONG TAM GIÁC VUÔNG",
      "content": "Tìm hiểu về tỉ số lượng giác của góc nhọn và các hệ thức lượng để giải tam giác vuông và ứng dụng thực tế.",
      "objectives": [
        "Tính các tỉ số lượng giác sin, cos, tan, cot của một góc nhọn.",
        "Sử dụng tỉ số lượng giác của các góc đặc biệt (30°, 45°, 60°).",
        "Áp dụng quan hệ giữa tỉ số lượng giác của hai góc phụ nhau."
      ],
      "common_exercises": []
    },
    "Bài 12. Một số hệ thức giữa cạnh, góc trong tam giác vuông và ứng dụng": {
      "chapter": "HỆ THỨC LƯỢNG TRONG TAM GIÁC VUÔNG",
      "content": "Tìm hiểu về tỉ số lượng giác của góc nhọn và các hệ thức lượng để giải tam giác vuông và ứng dụng thực tế.",
      "objectives": [
        "Áp dụng các hệ thức lượng để giải tam giác vuông.",
        "Giải các bài toán thực tế liên quan đến việc giải tam giác vuông."
      ],
      "common_exercises": []
    },
    "Bài 13. Mở đầu về đường tròn": {
      "chapter": "ĐƯỜNG TRÒN",
      "content": "Nghiên cứu các khái niệm về đường tròn, cung và dây, vị trí tương đối của đường thẳng và đường tròn, hai đường tròn.",
      "objectives": [
        "Xác định một điểm nằm trên, trong hay ngoài đường tròn.",
        "Nhận biết tâm đối xứng và trục đối xứng của đường tròn."
      ],
      "common_exercises": []
    },
    "Bài 14. Cung và dây của một đường tròn": {
      "chapter": "ĐƯỜNG TRÒN",
      "content": "Nghiên cứu các khái niệm về đường tròn, cung và dây, vị trí tương đối của đường thẳng và đường tròn, hai đường tròn.",
      "objectives": [
        "So sánh độ dài đường kính và dây cung.",
        "Xác định số đo của một cung tròn."
      ],
      "common_exercises": []
    },
    "Bài 15. Độ dài của cung tròn. Diện tích hình quạt tròn và hình vành khuyên": {
      "chapter": "ĐƯỜNG TRÒN",
      "content": "Nghiên cứu các khái niệm về đường tròn, cung và dây, vị trí tương đối của đường thẳng và đường tròn, hai đường tròn.",
      "objectives": [
        "Tính độ dài cung tròn.",
        "Tính diện tích hình quạt tròn và hình vành khuyên."
      ],
      "common_exercises": []
    },
    "Bài 16. Vị trí tương đối của đường thẳng và đường tròn": {
      "chapter": "ĐƯỜNG TRÒN",
      "content": "Nghiên cứu các khái niệm về đường tròn, cung và dây, vị trí tương đối của đường thẳng và đường tròn, hai đường tròn.",
      "objectives": [
        "Xét vị trí tương đối của đường thẳng và đường tròn dựa vào khoảng cách từ tâm đến đường thẳng.",
        "Áp dụng tính chất của tiếp tuyến."
      ],
      "common_exercises": []
    },
    "Bài 17. Vị trí tương đối của hai đường tròn": {
      "chapter": "ĐƯỜNG TRÒN",
      "content": "Nghiên cứu các khái niệm về đường tròn, cung và dây, vị trí tương đối của đường thẳng và đường tròn, hai đường tròn.",
      "objectives": [
        "Xét vị trí tương đối của hai đường tròn dựa vào đoạn nối tâm và các bán kính."
      ],
      "common_exercises": []
    },
    "Bài 18. Hàm số y = ax² (a≠0)": {
      "chapter": "HÀM SỐ y = ax² (a≠0). PHƯƠNG TRÌNH BẬC HAI MỘT ẨN",
      "content": "Khảo sát hàm số y = ax², giải phương trình bậc hai bằng công thức nghiệm, định lí Viète và giải toán bằng cách lập phương trình bậc hai.",
      "objectives": [
        "Lập bảng giá trị và vẽ đồ thị hàm số y = ax².",
        "Nhận biết tính đối xứng của đồ thị hàm số y = ax²."
      ],
      "common_exercises": []
    },
    "Bài 19. Phương trình bậc hai một ẩn": {
      "chapter": "HÀM SỐ y = ax² (a≠0). PHƯƠNG TRÌNH BẬC HAI MỘT ẨN",
      "content": "Khảo sát hàm số y = ax², giải phương trình bậc hai bằng công thức nghiệm, định lí Viète và giải toán bằng cách lập phương trình bậc hai.",
      "objectives": [
        "Giải phương trình bậc hai dạng khuyết b hoặc c.",
        "Giải phương trình bậc hai bằng công thức nghiệm và công thức nghiệm thu gọn."
      ],
      "common_exercises": []
    },
    "Bài 20. Định lí Viète và ứng dụng": {
      "chapter": "HÀM SỐ y = ax² (a≠0). PHƯƠNG TRÌNH BẬC HAI MỘT ẨN",
      "content": "Khảo sát hàm số y = ax², giải phương trình bậc hai bằng công thức nghiệm, định lí Viète và giải toán bằng cách lập phương trình bậc hai.",
      "objectives": [
        "Tính tổng và tích các nghiệm của phương trình bậc hai bằng định lí Viète.",
        "Nhẩm nghiệm của phương trình bậc hai trong các trường hợp đặc biệt.",
        "Tìm hai số khi biết tổng và tích của chúng."
      ],
      "common_exercises": []
    },
    "Bài 21. Giải bài toán bằng cách lập phương trình": {
      "chapter": "HÀM SỐ y = ax² (a≠0). PHƯƠNG TRÌNH BẬC HAI MỘT ẨN",
      "content": "Khảo sát hàm số y = ax², giải phương trình bậc hai bằng công thức nghiệm, định lí Viète và giải toán bằng cách lập phương trình bậc hai.",
      "objectives": [
        "Giải các bài toán thực tế bằng cách lập phương trình bậc hai một ẩn."
      ],
      "common_exercises": []
    },
    "Bài 22. Bảng tần số và biểu đồ tần số": {
      "chapter": "TẦN SỐ VÀ TẦN SỐ TƯƠNG ĐỐI",
      "content": "Tìm hiểu về cách lập bảng tần số, tần số tương đối (ghép nhóm và không ghép nhóm) và các biểu đồ tương ứng.",
      "objectives": [
        "Lập bảng tần số từ một mẫu dữ liệu.",
        "Vẽ biểu đồ tần số dạng cột và dạng đoạn thẳng."
      ],
      "common_exercises": []
    },
    "Bài 23. Bảng tần số tương đối và biểu đồ tần số tương đối": {
      "chapter": "TẦN SỐ VÀ TẦN SỐ TƯƠNG ĐỐI",
      "content": "Tìm hiểu về cách lập bảng tần số, tần số tương đối (ghép nhóm và không ghép nhóm) và các biểu đồ tương ứng.",
      "objectives": [
        "Lập bảng tần số tương đối.",
        "Vẽ biểu đồ tần số tương đối dạng cột và dạng hình quạt tròn."
      ],
      "common_exercises": []
    },
    "Bài 24. Bảng tần số, tần số tương đối ghép nhóm và biểu đồ": {
      "chapter": "TẦN SỐ VÀ TẦN SỐ TƯƠNG ĐỐI",
      "content": "Tìm hiểu về cách lập bảng tần số, tần số tương đối (ghép nhóm và không ghép nhóm) và các biểu đồ tương ứng.",
      "objectives": [
        "Lập bảng tần số và tần số tương đối ghép nhóm.",
        "Vẽ biểu đồ tần số tương đối ghép nhóm dạng cột và dạng đoạn thẳng."
      ],
      "common_exercises": []
    },
    "Bài 25. Phép thử ngẫu nhiên và không gian mẫu": {
      "chapter": "XÁC SUẤT CỦA BIẾN CỐ TRONG MỘT SỐ MÔ HÌNH XÁC SUẤT ĐƠN GIẢN",
      "content": "Mô tả không gian mẫu, biến cố và tính xác suất của biến cố trong các phép thử có kết quả đồng khả năng.",
      "objectives": [
        "Mô tả không gian mẫu của một phép thử ngẫu nhiên."
      ],
      "common_exercises": []
    },
    "Bài 26. Xác suất của biến cố liên quan tới phép thử": {
      "chapter": "XÁC SUẤT CỦA BIẾN CỐ TRONG MỘT SỐ MÔ HÌNH XÁC SUẤT ĐƠN GIẢN",
      "content": "Mô tả không gian mẫu, biến cố và tính xác suất của biến cố trong các phép thử có kết quả đồng khả năng.",
      "objectives": [
        "Mô tả các kết quả thuận lợi cho một biến cố.",
        "Tính xác suất của một biến cố trong các phép thử có kết quả đồng khả năng."
      ],
      "common_exercises": []
    },
    "Bài 27. Góc nội tiếp": {
      "chapter": "ĐƯỜNG TRÒN NGOẠI TIẾP VÀ ĐƯỜNG TRÒN NỘI TIẾP",
      "content": "Nghiên cứu về góc nội tiếp, tứ giác nội tiếp, đường tròn ngoại tiếp, nội tiếp tam giác và đa giác đều.",
      "objectives": [
        "Nhận biết góc nội tiếp và cung bị chắn.",
        "Áp dụng định lí về số đo góc nội tiếp."
      ],
      "common_exercises": []
    },
    "Bài 28. Đường tròn ngoại tiếp và đường tròn nội tiếp của một tam giác": {
      "chapter": "ĐƯỜNG TRÒN NGOẠI TIẾP VÀ ĐƯỜNG TRÒN NỘI TIẾP",
      "content": "Nghiên cứu về góc nội tiếp, tứ giác nội tiếp, đường tròn ngoại tiếp, nội tiếp tam giác và đa giác đều.",
      "objectives": [
        "Xác định tâm và bán kính đường tròn ngoại tiếp, nội tiếp của tam giác (đặc biệt là tam giác vuông, tam giác đều)."
      ],
      "common_exercises": []
    },
    "Bài 29. Tứ giác nội tiếp": {
      "chapter": "ĐƯỜNG TRÒN NGOẠI TIẾP VÀ ĐƯỜNG TRÒN NỘI TIẾP",
      "content": "Nghiên cứu về góc nội tiếp, tứ giác nội tiếp, đường tròn ngoại tiếp, nội tiếp tam giác và đa giác đều.",
      "objectives": [
        "Áp dụng định lí về tổng hai góc đối của tứ giác nội tiếp.",
        "Xác định đường tròn ngoại tiếp của hình chữ nhật, hình vuông."
      ],
      "common_exercises": []
    },
    "Bài 30. Đa giác đều": {
      "chapter": "ĐƯỜNG TRÒN NGOẠI TIẾP VÀ ĐƯỜNG TRÒN NỘI TIẾP",
      "content": "Nghiên cứu về góc nội tiếp, tứ giác nội tiếp, đường tròn ngoại tiếp, nội tiếp tam giác và đa giác đều.",
      "objectives": [
        "Nhận biết đa giác đều và đường tròn ngoại tiếp đa giác đều.",
        "Nhận biết các phép quay giữ nguyên một đa giác đều."
      ],
      "common_exercises": []
    },
    "Bài 31. Hình trụ và hình nón": {
      "chapter": "MỘT SỐ HÌNH KHỐI TRONG THỰC TIỄN",
      "content": "Mô tả và tính toán diện tích, thể tích của các hình khối như hình trụ, hình nón và hình cầu.",
      "objectives": [
        "Mô tả các yếu tố của hình trụ, hình nón.",
        "Tính diện tích xung quanh và thể tích của hình trụ, hình nón."
      ],
      "common_exercises": []
    },
    "Bài 32. Hình cầu": {
      "chapter": "MỘT SỐ HÌNH KHỐI TRONG THỰC TIỄN",
      "content": "Mô tả và tính toán diện tích, thể tích của các hình khối như hình trụ, hình nón và hình cầu.",
      "objectives": [
        "Mô tả các yếu tố của hình cầu.",
        "Tính diện tích mặt cầu và thể tích hình cầu."
      ],
      "common_exercises": []
    }
  },
  "10": {
    "Bài 1. Mệnh đề": {
      "chapter": "MỆNH ĐỀ VÀ TẬP HỢP",
      "content": "Nghiên cứu về mệnh đề, mệnh đề chứa biến, mệnh đề phủ định, kéo theo, tương đương và các kí hiệu logic trong toán học.",
      "objectives": [
        "Nhận biết mệnh đề, mệnh đề chứa biến, xác định tính đúng sai của một mệnh đề.",
        "Phát biểu mệnh đề phủ định của một mệnh đề và xác định tính đúng sai.",
        "Phát biểu mệnh đề kéo theo, mệnh đề đảo từ hai mệnh đề đã cho và xác định tính đúng sai.",
        "Phát biểu mệnh đề tương đương và xác định tính đúng sai.",
        "Vận dụng các khái niệm 'điều kiện cần', 'điều kiện đủ', 'điều kiện cần và đủ' để diễn đạt các định lí toán học.",
        "Sử dụng các kí hiệu ∀, ∃ để viết các mệnh đề toán học.",
        "Lập mệnh đề phủ định của mệnh đề chứa kí hiệu ∀, ∃ và xác định tính đúng sai."
      ],
      "common_exercises": [
        "Xác định tính đúng sai của mệnh đề.",
        "Lập mệnh đề phủ định, kéo theo, tương đương.",
        "Sử dụng kí hiệu ∀, ∃ để viết các mệnh đề."
      ]
    },
    "Bài 2. Tập hợp và các phép toán trên tập hợp": {
      "chapter": "MỆNH ĐỀ VÀ TẬP HỢP",
      "content": "Nghiên cứu về các khái niệm tập hợp, tập con, các phép toán hợp, giao, hiệu của hai tập hợp và biểu đồ Ven.",
      "objectives": [
        "Viết một tập hợp bằng cách liệt kê các phần tử hoặc chỉ ra tính chất đặc trưng.",
        "Xác định một phần tử có thuộc một tập hợp hay không.",
        "Tìm tất cả các tập con của một tập hợp cho trước.",
        "Kiểm tra hai tập hợp có bằng nhau không.",
        "Thực hiện các phép toán: hợp, giao, hiệu của hai tập hợp.",
        "Tìm phần bù của một tập con.",
        "Biểu diễn các tập hợp số (khoảng, đoạn, nửa khoảng) trên trục số.",
        "Thực hiện các phép toán hợp, giao, hiệu trên các tập hợp số và biểu diễn kết quả trên trục số.",
        "Giải quyết các bài toán thực tế sử dụng biểu đồ Ven để đếm số phần tử."
      ],
      "common_exercises": [
        "Thực hiện các phép toán trên tập hợp.",
        "Biểu diễn tập hợp số trên trục số.",
        "Giải quyết bài toán thực tế bằng biểu đồ Ven."
      ]
    },
    "Bài 3. Bất phương trình bậc nhất hai ẩn": {
      "chapter": "BẤT PHƯƠNG TRÌNH VÀ HỆ BẤT PHƯƠNG TRÌNH BẬC NHẤT HAI ẨN",
      "content": "Nghiên cứu cách biểu diễn miền nghiệm của bất phương trình bậc nhất hai ẩn trên mặt phẳng tọa độ.",
      "objectives": [
        "Kiểm tra một cặp số có phải là nghiệm của một bất phương trình bậc nhất hai ẩn hay không.",
        "Biểu diễn miền nghiệm của một bất phương trình bậc nhất hai ẩn trên mặt phẳng tọa độ."
      ],
      "common_exercises": [
        "Xác định nghiệm của bất phương trình.",
        "Biểu diễn miền nghiệm trên mặt phẳng tọa độ."
      ]
    },
    "Bài 4. Hệ bất phương trình bậc nhất hai ẩn": {
      "chapter": "BẤT PHƯƠNG TRÌNH VÀ HỆ BẤT PHƯƠNG TRÌNH BẬC NHẤT HAI ẨN",
      "content": "Nghiên cứu cách biểu diễn miền nghiệm của hệ bất phương trình bậc nhất hai ẩn và ứng dụng vào bài toán tối ưu hóa trong thực tế.",
      "objectives": [
        "Kiểm tra một cặp số có phải là nghiệm của một hệ bất phương trình bậc nhất hai ẩn hay không.",
        "Biểu diễn miền nghiệm của một hệ bất phương trình bậc nhất hai ẩn trên mặt phẳng tọa độ.",
        "Mô hình hóa bài toán thực tế bằng hệ bất phương trình bậc nhất hai ẩn.",
        "Tìm giá trị lớn nhất, giá trị nhỏ nhất của biểu thức F(x,y) = ax + by trên một miền đa giác (bài toán tối ưu hóa)."
      ],
      "common_exercises": [
        "Biểu diễn miền nghiệm của hệ bất phương trình.",
        "Giải các bài toán tối ưu hóa thực tế."
      ]
    },
    "Bài 5. Giá trị lượng giác của một góc từ 0° đến 180°": {
      "chapter": "HỆ THỨC LƯỢNG TRONG TAM GIÁC",
      "content": "Tìm hiểu về các giá trị lượng giác của một góc từ 0 đến 180 độ và mối quan hệ giữa các giá trị lượng giác của các góc có liên quan đặc biệt.",
      "objectives": [
        "Tính giá trị lượng giác (sin, cos, tan, cot) của các góc đặc biệt.",
        "Sử dụng máy tính cầm tay để tính giá trị lượng giác của một góc.",
        "Vận dụng mối quan hệ giữa các giá trị lượng giác của hai góc bù nhau, phụ nhau để rút gọn biểu thức hoặc tính toán."
      ],
      "common_exercises": [
        "Tính giá trị lượng giác của góc đặc biệt.",
        "Rút gọn biểu thức lượng giác."
      ]
    },
    "Bài 6. Hệ thức lượng trong tam giác": {
      "chapter": "HỆ THỨC LƯỢNG TRONG TAM GIÁC",
      "content": "Nghiên cứu các hệ thức lượng trong tam giác như định lí côsin, định lí sin và các công thức tính diện tích tam giác để giải các bài toán thực tế.",
      "objectives": [
        "Áp dụng Định lí côsin để tính độ dài cạnh của tam giác khi biết hai cạnh và góc xen giữa.",
        "Áp dụng Định lí côsin để tính số đo góc của tam giác khi biết độ dài ba cạnh.",
        "Áp dụng Định lí sin để tính độ dài cạnh, số đo góc, bán kính đường tròn ngoại tiếp tam giác.",
        "Vận dụng các công thức tính diện tích tam giác (S = 1/2 bc sinA, S = pr, S = abc/4R, công thức Heron).",
        "Giải tam giác trong các trường hợp: biết cạnh-góc-cạnh, góc-cạnh-góc, cạnh-cạnh-cạnh.",
        "Giải quyết các bài toán thực tế về đo đạc khoảng cách, chiều cao sử dụng hệ thức lượng."
      ],
      "common_exercises": [
        "Sử dụng định lí sin và côsin để giải tam giác.",
        "Tính diện tích tam giác bằng nhiều công thức.",
        "Giải các bài toán đo đạc thực tế."
      ]
    },
    "Bài 7. Các khái niệm mở đầu về Vectơ": {
      "chapter": "VECTƠ",
      "content": "Tìm hiểu các khái niệm cơ bản về vectơ, hai vectơ cùng phương, cùng hướng, bằng nhau và độ dài của vectơ.",
      "objectives": [
        "Nhận biết và phân biệt hai vectơ cùng phương, cùng hướng, ngược hướng, bằng nhau.",
        "Tính độ dài của vectơ."
      ],
      "common_exercises": [
        "Xác định các cặp vectơ bằng nhau, cùng phương.",
        "Tính độ dài vectơ."
      ]
    },
    "Bài 8. Tổng và hiệu của hai vectơ": {
      "chapter": "VECTƠ",
      "content": "Nghiên cứu phép cộng và phép trừ hai vectơ theo quy tắc ba điểm, quy tắc hình bình hành và ứng dụng để chứng minh các đẳng thức vectơ.",
      "objectives": [
        "Thực hiện phép cộng, trừ hai vectơ bằng quy tắc ba điểm, quy tắc hình bình hành.",
        "Vận dụng các tính chất của phép toán vectơ để rút gọn biểu thức, chứng minh đẳng thức vectơ."
      ],
      "common_exercises": [
        "Cộng, trừ vectơ bằng các quy tắc.",
        "Rút gọn biểu thức và chứng minh đẳng thức vectơ."
      ]
    },
    "Bài 9. Tích của một vectơ với một số": {
      "chapter": "VECTƠ",
      "content": "Nghiên cứu phép nhân một vectơ với một số, phân tích một vectơ theo hai vectơ không cùng phương và ứng dụng để chứng minh tính thẳng hàng.",
      "objectives": [
        "Thực hiện phép nhân một vectơ với một số, xác định phương, hướng, độ dài của vectơ kết quả.",
        "Phân tích một vectơ theo hai vectơ không cùng phương.",
        "Vận dụng vectơ để chứng minh ba điểm thẳng hàng, chứng minh hai đường thẳng song song.",
        "Vận dụng vectơ để xác định vị trí điểm thỏa mãn đẳng thức vectơ (trung điểm, trọng tâm,...)."
      ],
      "common_exercises": [
        "Phân tích một vectơ theo hai vectơ khác.",
        "Chứng minh ba điểm thẳng hàng.",
        "Tìm tọa độ điểm thỏa mãn đẳng thức vectơ."
      ]
    },
    "Bài 10. Vectơ trong mặt phẳng toạ độ": {
      "chapter": "VECTƠ",
      "content": "Nghiên cứu biểu diễn vectơ trong mặt phẳng tọa độ, thực hiện các phép toán vectơ thông qua tọa độ và ứng dụng.",
      "objectives": [
        "Tìm tọa độ của vectơ khi biết tọa độ điểm đầu, điểm cuối.",
        "Thực hiện các phép toán cộng, trừ vectơ, nhân vectơ với một số thông qua tọa độ.",
        "Tính độ dài vectơ và khoảng cách giữa hai điểm khi biết tọa độ.",
        "Vận dụng tọa độ vectơ để tìm tọa độ trung điểm của đoạn thẳng, trọng tâm của tam giác."
      ],
      "common_exercises": [
        "Thực hiện các phép toán vectơ qua tọa độ.",
        "Tính khoảng cách giữa hai điểm.",
        "Tìm tọa độ trung điểm, trọng tâm."
      ]
    },
    "Bài 11. Tích vô hướng của hai vectơ": {
      "chapter": "VECTƠ",
      "content": "Nghiên cứu về tích vô hướng của hai vectơ, biểu thức tọa độ của tích vô hướng và ứng dụng để xác định góc, tính vuông góc.",
      "objectives": [
        "Tính tích vô hướng của hai vectơ khi biết độ dài và góc giữa chúng.",
        "Tính tích vô hướng của hai vectơ thông qua biểu thức tọa độ.",
        "Ứng dụng tích vô hướng để xác định góc giữa hai vectơ và kiểm tra tính vuông góc.",
        "Giải quyết các bài toán hình học phẳng (tính độ dài, tính góc, chứng minh tính chất) bằng phương pháp tọa độ."
      ],
      "common_exercises": [
        "Tính tích vô hướng của hai vectơ.",
        "Xác định góc giữa hai vectơ.",
        "Chứng minh hai vectơ vuông góc."
      ]
    },
    "Bài 12. Số gần đúng và sai số": {
      "chapter": "THỐNG KÊ",
      "content": "Tìm hiểu về cách quy tròn số gần đúng và ước lượng sai số tuyệt đối, sai số tương đối trong các phép đo.",
      "objectives": [
        "Quy tròn số gần đúng với độ chính xác cho trước.",
        "Ước lượng sai số tuyệt đối, sai số tương đối của một số gần đúng."
      ],
      "common_exercises": [
        "Quy tròn số gần đúng.",
        "Tính sai số tuyệt đối và tương đối."
      ]
    },
    "Bài 13. Các số đặc trưng đo xu thế trung tâm": {
      "chapter": "THỐNG KÊ",
      "content": "Nghiên cứu các số đặc trưng đo xu thế trung tâm của mẫu số liệu không ghép nhóm như số trung bình, trung vị, mốt và tứ phân vị.",
      "objectives": [
        "Tính toán và giải thích ý nghĩa của số trung bình, trung vị, mốt.",
        "Tính toán và giải thích ý nghĩa của tứ phân vị."
      ],
      "common_exercises": [
        "Tính số trung bình, trung vị, mốt.",
        "Tính và giải thích ý nghĩa tứ phân vị."
      ]
    },
    "Bài 14. Các số đặc trưng đo độ phân tán": {
      "chapter": "THỐNG KÊ",
      "content": "Nghiên cứu các số đặc trưng đo độ phân tán của mẫu số liệu không ghép nhóm như khoảng biến thiên, phương sai và độ lệch chuẩn.",
      "objectives": [
        "Tính toán và giải thích ý nghĩa của khoảng biến thiên, khoảng tứ phân vị.",
        "Tính toán và giải thích ý nghĩa của phương sai, độ lệch chuẩn.",
        "Lựa chọn số đặc trưng phù hợp để mô tả xu thế trung tâm và độ phân tán của mẫu số liệu.",
        "Phát hiện các giá trị bất thường trong mẫu số liệu và phân tích ảnh hưởng của chúng."
      ],
      "common_exercises": [
        "Tính khoảng biến thiên, khoảng tứ phân vị.",
        "Tính phương sai và độ lệch chuẩn.",
        "Phân tích và phát hiện giá trị bất thường."
      ]
    },
    "Bài 15. Hàm số": {
      "chapter": "HÀM SỐ, ĐỒ THỊ VÀ ỨNG DỤNG",
      "content": "Tìm hiểu các khái niệm cơ bản về hàm số như tập xác định, tập giá trị và sự biến thiên của hàm số.",
      "objectives": [
        "Tìm tập xác định, tập giá trị của hàm số.",
        "Xác định khoảng đồng biến, nghịch biến của hàm số dựa vào đồ thị."
      ],
      "common_exercises": [
        "Tìm tập xác định và tập giá trị của hàm số.",
        "Xét tính đơn điệu của hàm số."
      ]
    },
    "Bài 16. Hàm số bậc hai": {
      "chapter": "HÀM SỐ, ĐỒ THỊ VÀ ỨNG DỤNG",
      "content": "Nghiên cứu về hàm số bậc hai, cách lập bảng biến thiên, vẽ đồ thị parabol và ứng dụng trong các bài toán thực tế.",
      "objectives": [
        "Lập bảng biến thiên và vẽ đồ thị hàm số bậc hai (parabol).",
        "Xác định đỉnh, trục đối xứng, giao điểm với các trục tọa độ của parabol.",
        "Dựa vào đồ thị để biện luận số nghiệm của phương trình, bất phương trình liên quan đến hàm số bậc hai.",
        "Tìm giá trị lớn nhất, giá trị nhỏ nhất của hàm số bậc hai trên một đoạn.",
        "Mô hình hóa và giải quyết các bài toán thực tiễn gắn với hàm số bậc hai."
      ],
      "common_exercises": [
        "Khảo sát và vẽ đồ thị hàm số bậc hai.",
        "Tìm giá trị lớn nhất, nhỏ nhất của hàm số bậc hai.",
        "Giải quyết bài toán thực tế bằng hàm số bậc hai."
      ]
    },
    "Bài 17. Dấu của tam thức bậc hai": {
      "chapter": "HÀM SỐ, ĐỒ THỊ VÀ ỨNG DỤNG",
      "content": "Nghiên cứu về cách xét dấu của tam thức bậc hai và ứng dụng để giải bất phương trình bậc hai một ẩn.",
      "objectives": [
        "Xét dấu một tam thức bậc hai.",
        "Giải bất phương trình bậc hai một ẩn.",
        "Giải các bất phương trình dạng tích, thương của các tam thức bậc hai.",
        "Tìm điều kiện của tham số để tam thức bậc hai không đổi dấu trên R."
      ],
      "common_exercises": [
        "Xét dấu tam thức bậc hai.",
        "Giải bất phương trình bậc hai.",
        "Bài toán tham số liên quan đến dấu của tam thức bậc hai."
      ]
    },
    "Bài 18. Phương trình quy về phương trình bậc hai": {
      "chapter": "HÀM SỐ, ĐỒ THỊ VÀ ỨNG DỤNG",
      "content": "Nghiên cứu các phương pháp giải phương trình chứa ẩn dưới dấu căn có thể quy về phương trình bậc hai.",
      "objectives": [
        "Giải phương trình chứa ẩn dưới dấu căn dạng √f(x) = g(x) và √f(x) = √g(x)."
      ],
      "common_exercises": [
        "Giải phương trình dạng √f(x) = g(x).",
        "Giải phương trình dạng √f(x) = √g(x)."
      ]
    },
    "Bài 19. Phương trình đường thẳng": {
      "chapter": "PHƯƠNG PHÁP TOẠ ĐỘ TRONG MẶT PHẲNG",
      "content": "Nghiên cứu cách viết phương trình tham số và phương trình tổng quát của đường thẳng trong mặt phẳng tọa độ.",
      "objectives": [
        "Viết phương trình tham số, phương trình tổng quát của đường thẳng khi biết một điểm và một vectơ chỉ phương/pháp tuyến.",
        "Viết phương trình đường thẳng đi qua hai điểm."
      ],
      "common_exercises": [
        "Viết phương trình tham số và tổng quát của đường thẳng.",
        "Viết phương trình đường thẳng đi qua hai điểm."
      ]
    },
    "Bài 20. Vị trí tương đối giữa hai đường thẳng. Góc và khoảng cách": {
      "chapter": "PHƯƠNG PHÁP TOẠ ĐỘ TRONG MẶT PHẲNG",
      "content": "Nghiên cứu cách xét vị trí tương đối, tính góc giữa hai đường thẳng và khoảng cách từ một điểm đến một đường thẳng.",
      "objectives": [
        "Xét vị trí tương đối của hai đường thẳng.",
        "Tính góc giữa hai đường thẳng.",
        "Tính khoảng cách từ một điểm đến một đường thẳng."
      ],
      "common_exercises": [
        "Xét vị trí tương đối của hai đường thẳng.",
        "Tính góc và khoảng cách."
      ]
    },
    "Bài 21. Đường tròn trong mặt phẳng toạ độ": {
      "chapter": "PHƯƠNG PHÁP TOẠ ĐỘ TRONG MẶT PHẲNG",
      "content": "Nghiên cứu về phương trình đường tròn và phương trình tiếp tuyến của đường tròn trong mặt phẳng tọa độ.",
      "objectives": [
        "Viết phương trình đường tròn khi biết tâm và bán kính.",
        "Nhận dạng phương trình đường tròn, xác định tâm và bán kính.",
        "Viết phương trình tiếp tuyến của đường tròn tại một điểm thuộc đường tròn."
      ],
      "common_exercises": [
        "Viết phương trình đường tròn.",
        "Xác định tâm và bán kính.",
        "Viết phương trình tiếp tuyến."
      ]
    },
    "Bài 22. Ba đường conic": {
      "chapter": "PHƯƠNG PHÁP TOẠ ĐỘ TRONG MẶT PHẲNG",
      "content": "Nghiên cứu về phương trình chính tắc và các yếu tố của ba đường conic: elip, hypebol và parabol.",
      "objectives": [
        "Nhận dạng và viết phương trình chính tắc của elip, hypebol, parabol.",
        "Xác định các yếu tố của conic (tiêu điểm, đỉnh, trục, tâm sai, đường chuẩn...) từ phương trình chính tắc.",
        "Viết phương trình chính tắc của conic khi biết một số yếu tố.",
        "Giải quyết một số vấn đề thực tiễn gắn với ba đường conic."
      ],
      "common_exercises": [
        "Viết phương trình chính tắc của elip, hypebol, parabol.",
        "Xác định các yếu tố của đường conic.",
        "Giải các bài toán thực tế liên quan đến conic."
      ]
    },
    "Bài 23. Quy tắc đếm": {
      "chapter": "ĐẠI SỐ TỔ HỢP",
      "content": "Tìm hiểu về quy tắc cộng và quy tắc nhân, hai quy tắc cơ bản trong các bài toán đếm.",
      "objectives": [
        "Vận dụng quy tắc cộng và quy tắc nhân trong các bài toán đếm.",
        "Sử dụng sơ đồ hình cây trong các bài toán đếm đơn giản."
      ],
      "common_exercises": [
        "Áp dụng quy tắc cộng và nhân để giải toán đếm.",
        "Sử dụng sơ đồ cây."
      ]
    },
    "Bài 24. Hoán vị, chỉnh hợp và tổ hợp": {
      "chapter": "ĐẠI SỐ TỔ HỢP",
      "content": "Nghiên cứu các khái niệm hoán vị, chỉnh hợp, tổ hợp và ứng dụng trong các bài toán chọn và sắp xếp.",
      "objectives": [
        "Tính số hoán vị, chỉnh hợp, tổ hợp.",
        "Phân biệt và vận dụng hoán vị, chỉnh hợp, tổ hợp trong các bài toán chọn và sắp xếp.",
        "Giải các bài toán đếm phức tạp (lập số, chọn người, xếp đồ vật) có điều kiện."
      ],
      "common_exercises": [
        "Phân biệt và áp dụng hoán vị, chỉnh hợp, tổ hợp.",
        "Giải các bài toán đếm nâng cao."
      ]
    },
    "Bài 25. Nhị thức Newton": {
      "chapter": "ĐẠI SỐ TỔ HỢP",
      "content": "Tìm hiểu công thức khai triển nhị thức Newton và ứng dụng để tìm hệ số của số hạng trong khai triển.",
      "objectives": [
        "Khai triển nhị thức Newton (a+b)^n với n=4, n=5.",
        "Tìm hệ số của một số hạng hoặc số hạng không chứa x trong khai triển nhị thức Newton."
      ],
      "common_exercises": [
        "Khai triển nhị thức Newton.",
        "Tìm hệ số, số hạng trong khai triển."
      ]
    },
    "Bài 26. Biến cố và định nghĩa cổ điển của xác suất": {
      "chapter": "XÁC SUẤT",
      "content": "Nghiên cứu các khái niệm cơ bản về xác suất như không gian mẫu, biến cố và định nghĩa cổ điển của xác suất.",
      "objectives": [
        "Mô tả không gian mẫu, biến cố trong các phép thử đơn giản.",
        "Thực hiện các phép toán trên biến cố (hợp, giao, đối).",
        "Nắm vững định nghĩa cổ điển của xác suất."
      ],
      "common_exercises": [
        "Xác định không gian mẫu và biến cố.",
        "Thực hiện các phép toán trên biến cố."
      ]
    },
    "Bài 27. Thực hành tính xác suất theo định nghĩa cổ điển": {
      "chapter": "XÁC SUẤT",
      "content": "Vận dụng các quy tắc đếm và định nghĩa cổ điển để giải các bài toán tính xác suất trong thực tế.",
      "objectives": [
        "Tính xác suất của biến cố bằng định nghĩa cổ điển.",
        "Vận dụng các quy tắc đếm (hoán vị, chỉnh hợp, tổ hợp) để tính số phần tử của không gian mẫu và biến cố.",
        "Sử dụng sơ đồ hình cây để tính xác suất.",
        "Vận dụng quy tắc tính xác suất của biến cố đối."
      ],
      "common_exercises": [
        "Tính xác suất bằng định nghĩa cổ điển.",
        "Sử dụng quy tắc đếm trong bài toán xác suất.",
        "Tính xác suất của biến cố đối."
      ]
    }
  },
  "11": {
    "Bài 1. Giá trị lượng giác của góc lượng giác": {
      "chapter": "HÀM SỐ LƯỢNG GIÁC VÀ PHƯƠNG TRÌNH LƯỢNG GIÁC",
      "content": "Nghiên cứu về góc lượng giác, đơn vị radian, đường tròn lượng giác và các giá trị lượng giác tương ứng.",
      "objectives": [
        "Đổi số đo góc từ độ sang radian và ngược lại.",
        "Tính độ dài cung tròn.",
        "Biểu diễn góc lượng giác trên đường tròn lượng giác.",
        "Tính các giá trị lượng giác của một góc lượng giác."
      ],
      "common_exercises": [
        "Đổi đơn vị độ và radian.",
        "Tính giá trị lượng giác của các góc đặc biệt."
      ]
    },
    "Bài 2. Công thức lượng giác": {
      "chapter": "HÀM SỐ LƯỢNG GIÁC VÀ PHƯƠNG TRÌNH LƯỢNG GIÁC",
      "content": "Tìm hiểu và vận dụng các công thức lượng giác cơ bản, công thức cộng, nhân đôi, hạ bậc và biến đổi tổng thành tích, tích thành tổng.",
      "objectives": [
        "Rút gọn biểu thức và chứng minh đẳng thức lượng giác sử dụng các công thức cơ bản.",
        "Áp dụng công thức cộng để tính giá trị lượng giác của các góc đặc biệt.",
        "Áp dụng công thức nhân đôi, hạ bậc.",
        "Biến đổi biểu thức lượng giác từ dạng tích thành tổng và ngược lại."
      ],
      "common_exercises": [
        "Chứng minh đẳng thức lượng giác.",
        "Rút gọn biểu thức lượng giác.",
        "Biến đổi tổng thành tích và ngược lại."
      ]
    },
    "Bài 3. Hàm số lượng giác": {
      "chapter": "HÀM SỐ LƯỢNG GIÁC VÀ PHƯƠNG TRÌNH LƯỢNG GIÁC",
      "content": "Nghiên cứu các hàm số lượng giác y = sinx, y = cosx, y = tanx, y = cotx về tập xác định, tính tuần hoàn, sự biến thiên và đồ thị.",
      "objectives": [
        "Tìm tập xác định, tập giá trị của các hàm số lượng giác.",
        "Xét tính chẵn, lẻ, tuần hoàn và chu kì của các hàm số lượng giác.",
        "Nhận dạng đồ thị và xác định các khoảng đồng biến, nghịch biến của các hàm số lượng giác."
      ],
      "common_exercises": [
        "Tìm tập xác định, tập giá trị, chu kì của hàm số lượng giác.",
        "Khảo sát và vẽ đồ thị hàm số lượng giác."
      ]
    },
    "Bài 4. Phương trình lượng giác cơ bản": {
      "chapter": "HÀM SỐ LƯỢNG GIÁC VÀ PHƯƠNG TRÌNH LƯỢNG GIÁC",
      "content": "Nghiên cứu các phương pháp giải các phương trình lượng giác cơ bản và các phương trình có thể đưa về dạng cơ bản.",
      "objectives": [
        "Giải các phương trình lượng giác cơ bản: sinx = a, cosx = a, tanx = a, cotx = a.",
        "Giải các phương trình lượng giác đưa về dạng cơ bản.",
        "Tìm nghiệm của phương trình lượng giác trong một khoảng, đoạn cho trước."
      ],
      "common_exercises": [
        "Giải các phương trình sinx=a, cosx=a, tanx=a, cotx=a.",
        "Tìm nghiệm của phương trình trên một khoảng cho trước."
      ]
    },
    "Bài 5. Dãy số": {
      "chapter": "DÃY SỐ. CẤP SỐ CỘNG VÀ CẤP SỐ NHÂN",
      "content": "Tìm hiểu các khái niệm về dãy số, cách cho dãy số, và các tính chất như tính tăng, giảm, bị chặn.",
      "objectives": [
        "Viết các số hạng đầu của dãy số cho bởi công thức tổng quát hoặc hệ thức truy hồi.",
        "Dự đoán công thức số hạng tổng quát của dãy số.",
        "Xét tính tăng, giảm, bị chặn của một dãy số."
      ],
      "common_exercises": [
        "Tìm các số hạng của dãy số.",
        "Xét tính đơn điệu và tính bị chặn của dãy số."
      ]
    },
    "Bài 6. Cấp số cộng": {
      "chapter": "DÃY SỐ. CẤP SỐ CỘNG VÀ CẤP SỐ NHÂN",
      "content": "Nghiên cứu về cấp số cộng, công thức số hạng tổng quát và công thức tính tổng n số hạng đầu.",
      "objectives": [
        "Chứng minh một dãy số là cấp số cộng.",
        "Tìm số hạng tổng quát, công sai của cấp số cộng.",
        "Tính tổng n số hạng đầu của một cấp số cộng.",
        "Giải quyết các bài toán thực tế liên quan đến cấp số cộng."
      ],
      "common_exercises": [
        "Tìm số hạng tổng quát và tổng n số hạng đầu của cấp số cộng.",
        "Giải các bài toán thực tế về cấp số cộng."
      ]
    },
    "Bài 7. Cấp số nhân": {
      "chapter": "DÃY SỐ. CẤP SỐ CỘNG VÀ CẤP SỐ NHÂN",
      "content": "Nghiên cứu về cấp số nhân, công thức số hạng tổng quát và công thức tính tổng n số hạng đầu.",
      "objectives": [
        "Chứng minh một dãy số là cấp số nhân.",
        "Tìm số hạng tổng quát, công bội của cấp số nhân.",
        "Tính tổng n số hạng đầu của một cấp số nhân.",
        "Giải quyết các bài toán thực tế liên quan đến cấp số nhân."
      ],
      "common_exercises": [
        "Tìm số hạng tổng quát và tổng n số hạng đầu của cấp số nhân.",
        "Giải các bài toán thực tế về cấp số nhân."
      ]
    },
    "Bài 8. Mẫu số liệu ghép nhóm": {
      "chapter": "THỐNG KÊ",
      "content": "Tìm hiểu cách tổ chức và trình bày một mẫu số liệu dưới dạng bảng tần số ghép nhóm.",
      "objectives": [
        "Lập bảng tần số ghép nhóm từ một mẫu số liệu.",
        "Đọc và giải thích mẫu số liệu ghép nhóm."
      ],
      "common_exercises": [
        "Lập bảng tần số ghép nhóm.",
        "Phân tích số liệu từ bảng tần số ghép nhóm."
      ]
    },
    "Bài 9. Các số đặc trưng đo xu thế trung tâm cho mẫu số liệu ghép nhóm": {
      "chapter": "THỐNG KÊ",
      "content": "Nghiên cứu cách tính và ý nghĩa của các số đặc trưng đo xu thế trung tâm như số trung bình, trung vị, mốt và tứ phân vị cho mẫu số liệu ghép nhóm.",
      "objectives": [
        "Tính số trung bình, trung vị, tứ phân vị, mốt cho mẫu số liệu ghép nhóm.",
        "Giải thích ý nghĩa và vai trò của các số đặc trưng đo xu thế trung tâm."
      ],
      "common_exercises": [
        "Tính số trung bình, trung vị, mốt cho mẫu số liệu ghép nhóm.",
        "So sánh các mẫu số liệu dựa trên các số đặc trưng."
      ]
    },
    "Bài 10. Đường thẳng và mặt phẳng trong không gian": {
      "chapter": "QUAN HỆ SONG SONG TRONG KHÔNG GIAN",
      "content": "Nghiên cứu các vị trí tương đối của điểm, đường thẳng, mặt phẳng trong không gian và cách xác định giao tuyến, giao điểm.",
      "objectives": [
        "Xác định giao tuyến của hai mặt phẳng.",
        "Xác định giao điểm của đường thẳng và mặt phẳng."
      ],
      "common_exercises": [
        "Tìm giao tuyến của hai mặt phẳng.",
        "Tìm giao điểm của đường thẳng và mặt phẳng."
      ]
    },
    "Bài 11. Hai đường thẳng song song": {
      "chapter": "QUAN HỆ SONG SONG TRONG KHÔNG GIAN",
      "content": "Nghiên cứu về vị trí tương đối của hai đường thẳng trong không gian, đặc biệt là quan hệ song song và chéo nhau.",
      "objectives": [
        "Chứng minh hai đường thẳng song song.",
        "Vận dụng định lí về ba giao tuyến."
      ],
      "common_exercises": [
        "Chứng minh hai đường thẳng song song.",
        "Sử dụng định lí về ba giao tuyến để giải toán."
      ]
    },
    "Bài 12. Đường thẳng và mặt phẳng song song": {
      "chapter": "QUAN HỆ SONG SONG TRONG KHÔNG GIAN",
      "content": "Nghiên cứu về điều kiện để đường thẳng song song với mặt phẳng và các tính chất liên quan.",
      "objectives": [
        "Chứng minh đường thẳng song song với mặt phẳng.",
        "Xác định thiết diện của hình chóp, hình lăng trụ khi cắt bởi một mặt phẳng song song với một đường thẳng."
      ],
      "common_exercises": [
        "Chứng minh đường thẳng song song với mặt phẳng.",
        "Tìm thiết diện song song với một đường thẳng."
      ]
    },
    "Bài 13. Hai mặt phẳng song song": {
      "chapter": "QUAN HỆ SONG SONG TRONG KHÔNG GIAN",
      "content": "Nghiên cứu về điều kiện để hai mặt phẳng song song, các tính chất và ứng dụng của chúng, bao gồm cả định lí Thalès trong không gian.",
      "objectives": [
        "Chứng minh hai mặt phẳng song song.",
        "Vận dụng định lí Thalès trong không gian.",
        "Xác định thiết diện của hình chóp, hình lăng trụ khi cắt bởi một mặt phẳng song song với một mặt phẳng khác."
      ],
      "common_exercises": [
        "Chứng minh hai mặt phẳng song song.",
        "Tìm thiết diện song song với một mặt phẳng.",
        "Áp dụng định lí Thalès trong không gian."
      ]
    },
    "Bài 14. Phép chiếu song song": {
      "chapter": "QUAN HỆ SONG SONG TRONG KHÔNG GIAN",
      "content": "Tìm hiểu về phép chiếu song song, các tính chất và cách vẽ hình biểu diễn của các hình không gian.",
      "objectives": [
        "Xác định ảnh của một điểm, một hình qua phép chiếu song song.",
        "Vẽ hình biểu diễn của một số hình không gian."
      ],
      "common_exercises": [
        "Tìm ảnh của hình qua phép chiếu song song.",
        "Vẽ hình biểu diễn của hình chóp, lăng trụ."
      ]
    },
    "Bài 15. Giới hạn của dãy số": {
      "chapter": "GIỚI HẠN. HÀM SỐ LIÊN TỤC",
      "content": "Nghiên cứu về khái niệm giới hạn của dãy số, các quy tắc tính giới hạn và tổng của cấp số nhân lùi vô hạn.",
      "objectives": [
        "Tính giới hạn của dãy số (dạng đa thức, phân thức, chứa căn).",
        "Tính tổng của cấp số nhân lùi vô hạn."
      ],
      "common_exercises": [
        "Tính giới hạn của dãy số.",
        "Tính tổng của cấp số nhân lùi vô hạn."
      ]
    },
    "Bài 16. Giới hạn của hàm số": {
      "chapter": "GIỚI HẠN. HÀM SỐ LIÊN TỤC",
      "content": "Nghiên cứu về khái niệm giới hạn của hàm số tại một điểm, tại vô cực và các quy tắc, phương pháp tính giới hạn, đặc biệt là cách khử các dạng vô định.",
      "objectives": [
        "Tính giới hạn của hàm số tại một điểm, tại vô cực.",
        "Khử các dạng vô định 0/0, ∞/∞, ∞ - ∞."
      ],
      "common_exercises": [
        "Tính giới hạn của hàm số.",
        "Khử các dạng vô định để tính giới hạn."
      ]
    },
    "Bài 17. Hàm số liên tục": {
      "chapter": "GIỚI HẠN. HÀM SỐ LIÊN TỤC",
      "content": "Tìm hiểu về khái niệm hàm số liên tục tại một điểm, trên một khoảng và ứng dụng để chứng minh sự tồn tại nghiệm của phương trình.",
      "objectives": [
        "Xét tính liên tục của hàm số tại một điểm, trên một khoảng.",
        "Chứng minh phương trình f(x) = 0 có nghiệm trong một khoảng."
      ],
      "common_exercises": [
        "Xét tính liên tục của hàm số.",
        "Chứng minh phương trình có nghiệm."
      ]
    },
    "Bài 18. Luỹ thừa với số mũ thực": {
      "chapter": "HÀM SỐ MŨ VÀ HÀM SỐ LÔGARIT",
      "content": "Nghiên cứu về lũy thừa với số mũ nguyên, hữu tỉ và thực, cùng các tính chất của chúng.",
      "objectives": [
        "Rút gọn biểu thức chứa lũy thừa.",
        "So sánh các lũy thừa."
      ],
      "common_exercises": [
        "Rút gọn và tính giá trị biểu thức lũy thừa.",
        "So sánh các lũy thừa."
      ]
    },
    "Bài 19. Lôgarit": {
      "chapter": "HÀM SỐ MŨ VÀ HÀM SỐ LÔGARIT",
      "content": "Nghiên cứu về khái niệm logarit, các tính chất và quy tắc tính logarit, bao gồm cả công thức đổi cơ số.",
      "objectives": [
        "Rút gọn biểu thức chứa logarit.",
        "So sánh các logarit."
      ],
      "common_exercises": [
        "Rút gọn và tính giá trị biểu thức logarit.",
        "So sánh các logarit."
      ]
    },
    "Bài 20. Hàm số mũ và hàm số lôgarit": {
      "chapter": "HÀM SỐ MŨ VÀ HÀM SỐ LÔGARIT",
      "content": "Nghiên cứu về tập xác định, tính chất và đồ thị của hàm số mũ và hàm số logarit.",
      "objectives": [
        "Tìm tập xác định của hàm số mũ, hàm số logarit.",
        "Khảo sát và vẽ đồ thị hàm số mũ, hàm số logarit."
      ],
      "common_exercises": [
        "Tìm tập xác định của hàm số mũ và logarit.",
        "Vẽ đồ thị và nhận dạng đồ thị của hàm số mũ, logarit."
      ]
    },
    "Bài 21. Phương trình, bất phương trình mũ và lôgarit": {
      "chapter": "HÀM SỐ MŨ VÀ HÀM SỐ LÔGARIT",
      "content": "Tìm hiểu các phương pháp giải phương trình và bất phương trình mũ, logarit như đưa về cùng cơ số, đặt ẩn phụ, logarit hóa.",
      "objectives": [
        "Giải phương trình, bất phương trình mũ và logarit bằng cách đưa về cùng cơ số, đặt ẩn phụ, logarit hóa."
      ],
      "common_exercises": [
        "Giải phương trình mũ, logarit.",
        "Giải bất phương trình mũ, logarit."
      ]
    },
    "Bài 22. Hai đường thẳng vuông góc": {
      "chapter": "QUAN HỆ VUÔNG GÓC TRONG KHÔNG GIAN",
      "content": "Nghiên cứu về góc giữa hai đường thẳng trong không gian và điều kiện để hai đường thẳng vuông góc.",
      "objectives": [
        "Tính góc giữa hai đường thẳng.",
        "Chứng minh hai đường thẳng vuông góc."
      ],
      "common_exercises": [
        "Tính góc giữa hai đường thẳng trong hình chóp, lăng trụ.",
        "Chứng minh hai đường thẳng vuông góc."
      ]
    },
    "Bài 23. Đường thẳng vuông góc với mặt phẳng": {
      "chapter": "QUAN HỆ VUÔNG GÓC TRONG KHÔNG GIAN",
      "content": "Nghiên cứu về điều kiện để đường thẳng vuông góc với mặt phẳng và các tính chất liên quan đến quan hệ vuông góc và song song.",
      "objectives": [
        "Chứng minh đường thẳng vuông góc với mặt phẳng.",
        "Vận dụng các tính chất về quan hệ song song và vuông góc của đường thẳng và mặt phẳng."
      ],
      "common_exercises": [
        "Chứng minh đường thẳng vuông góc với mặt phẳng.",
        "Chứng minh các quan hệ vuông góc khác dựa vào tính chất."
      ]
    },
    "Bài 24. Phép chiếu vuông góc. Góc giữa đường thẳng và mặt phẳng": {
      "chapter": "QUAN HỆ VUÔNG GÓC TRONG KHÔNG GIAN",
      "content": "Tìm hiểu về phép chiếu vuông góc, định lí ba đường vuông góc và cách xác định, tính góc giữa đường thẳng và mặt phẳng.",
      "objectives": [
        "Xác định hình chiếu vuông góc của điểm, đường thẳng, tam giác.",
        "Vận dụng định lí ba đường vuông góc.",
        "Tính góc giữa đường thẳng và mặt phẳng."
      ],
      "common_exercises": [
        "Xác định hình chiếu vuông góc.",
        "Tính góc giữa đường thẳng và mặt phẳng."
      ]
    },
    "Bài 25. Hai mặt phẳng vuông góc": {
      "chapter": "QUAN HỆ VUÔNG GÓC TRONG KHÔNG GIAN",
      "content": "Nghiên cứu về góc giữa hai mặt phẳng (góc nhị diện) và điều kiện để hai mặt phẳng vuông góc.",
      "objectives": [
        "Chứng minh hai mặt phẳng vuông góc.",
        "Tính góc giữa hai mặt phẳng (góc nhị diện)."
      ],
      "common_exercises": [
        "Tính góc giữa hai mặt phẳng.",
        "Chứng minh hai mặt phẳng vuông góc."
      ]
    },
    "Bài 26. Khoảng cách": {
      "chapter": "QUAN HỆ VUÔNG GÓC TRONG KHÔNG GIAN",
      "content": "Nghiên cứu các phương pháp tính khoảng cách trong không gian: từ điểm đến đường thẳng/mặt phẳng, giữa hai đường thẳng/mặt phẳng song song, và giữa hai đường thẳng chéo nhau.",
      "objectives": [
        "Tính khoảng cách từ một điểm đến một đường thẳng, một mặt phẳng.",
        "Tính khoảng cách giữa hai đường thẳng song song, hai mặt phẳng song song.",
        "Tính khoảng cách giữa hai đường thẳng chéo nhau."
      ],
      "common_exercises": [
        "Tính khoảng cách từ điểm đến mặt phẳng.",
        "Tính khoảng cách giữa hai đường thẳng chéo nhau."
      ]
    },
    "Bài 27. Thể tích": {
      "chapter": "QUAN HỆ VUÔNG GÓC TRONG KHÔNG GIAN",
      "content": "Tìm hiểu các công thức tính thể tích của các khối đa diện quen thuộc như khối chóp, khối lăng trụ, khối hộp.",
      "objectives": [
        "Tính thể tích khối chóp, khối lăng trụ, khối hộp.",
        "Tính thể tích khối chóp cụt đều."
      ],
      "common_exercises": [
        "Tính thể tích khối chóp.",
        "Tính thể tích khối lăng trụ."
      ]
    },
    "Bài 28. Biến cố hợp, biến cố giao, biến cố độc lập": {
      "chapter": "CÁC QUY TẮC TÍNH XÁC SUẤT",
      "content": "Nghiên cứu về các phép toán trên biến cố (hợp, giao) và khái niệm hai biến cố độc lập.",
      "objectives": [
        "Nhận biết và mô tả biến cố hợp, biến cố giao, biến cố độc lập."
      ],
      "common_exercises": [
        "Mô tả các biến cố hợp, giao, đối.",
        "Kiểm tra tính độc lập của hai biến cố."
      ]
    },
    "Bài 29. Công thức cộng xác suất": {
      "chapter": "CÁC QUY TẮC TÍNH XÁC SUẤT",
      "content": "Nghiên cứu và áp dụng công thức cộng xác suất cho hai biến cố xung khắc và hai biến cố bất kì.",
      "objectives": [
        "Áp dụng công thức cộng xác suất cho hai biến cố xung khắc và hai biến cố bất kì."
      ],
      "common_exercises": [
        "Áp dụng công thức cộng xác suất để giải toán."
      ]
    },
    "Bài 30. Công thức nhân xác suất cho hai biến cố độc lập": {
      "chapter": "CÁC QUY TẮC TÍNH XÁC SUẤT",
      "content": "Nghiên cứu và áp dụng công thức nhân xác suất cho hai biến cố độc lập để giải các bài toán xác suất tổng hợp.",
      "objectives": [
        "Áp dụng công thức nhân xác suất cho hai biến cố độc lập.",
        "Giải các bài toán xác suất tổng hợp sử dụng kết hợp các quy tắc."
      ],
      "common_exercises": [
        "Áp dụng công thức nhân xác suất để giải toán.",
        "Giải các bài toán xác suất kết hợp quy tắc cộng và nhân."
      ]
    },
    "Bài 31. Định nghĩa và ý nghĩa của đạo hàm": {
      "chapter": "ĐẠO HÀM",
      "content": "Tìm hiểu định nghĩa đạo hàm tại một điểm, ý nghĩa hình học (hệ số góc tiếp tuyến) và ý nghĩa vật lí (vận tốc tức thời).",
      "objectives": [
        "Tính đạo hàm của hàm số bằng định nghĩa.",
        "Viết phương trình tiếp tuyến của đồ thị hàm số tại một điểm.",
        "Giải các bài toán về vận tốc tức thời."
      ],
      "common_exercises": [
        "Tính đạo hàm bằng định nghĩa.",
        "Viết phương trình tiếp tuyến.",
        "Tính vận tốc tức thời."
      ]
    },
    "Bài 32. Các quy tắc tính đạo hàm": {
      "chapter": "ĐẠO HÀM",
      "content": "Nghiên cứu các quy tắc tính đạo hàm của tổng, hiệu, tích, thương, hàm hợp và đạo hàm của các hàm số sơ cấp cơ bản.",
      "objectives": [
        "Áp dụng các quy tắc tính đạo hàm (tổng, hiệu, tích, thương, hàm hợp).",
        "Tính đạo hàm của các hàm số lượng giác, mũ, logarit."
      ],
      "common_exercises": [
        "Tính đạo hàm bằng các quy tắc.",
        "Tính đạo hàm của hàm hợp."
      ]
    },
    "Bài 33. Đạo hàm cấp hai": {
      "chapter": "ĐẠO HÀM",
      "content": "Tìm hiểu về khái niệm đạo hàm cấp hai và ý nghĩa vật lí của nó (gia tốc tức thời).",
      "objectives": [
        "Tính đạo hàm cấp hai của một số hàm số đơn giản.",
        "Giải các bài toán về gia tốc tức thời."
      ],
      "common_exercises": [
        "Tính đạo hàm cấp hai.",
        "Tính gia tốc tức thời."
      ]
    }
  },
  "12": {
    "Bài 1. Tính đơn điệu và cực trị của hàm số": {
      "chapter": "ỨNG DỤNG ĐẠO HÀM ĐỂ KHẢO SÁT VÀ VẼ ĐỒ THỊ HÀM SỐ",
      "content": "Nghiên cứu ứng dụng của đạo hàm để xét tính đồng biến, nghịch biến và tìm các điểm cực trị của hàm số.",
      "objectives": [
        "Xét tính đồng biến, nghịch biến của hàm số trên một khoảng dựa vào dấu của đạo hàm.",
        "Tìm các điểm cực đại, cực tiểu và giá trị cực đại, cực tiểu của hàm số.",
        "Tìm điều kiện của tham số để hàm số đơn điệu trên một khoảng cho trước.",
        "Tìm điều kiện của tham số để hàm số đạt cực trị tại một điểm cho trước hoặc có số điểm cực trị xác định."
      ],
      "common_exercises": [
        "Xét tính đơn điệu của hàm số.",
        "Tìm cực trị của hàm số.",
        "Giải bài toán tham số liên quan đến tính đơn điệu và cực trị."
      ]
    },
    "Bài 2. Giá trị lớn nhất và giá trị nhỏ nhất của hàm số": {
      "chapter": "ỨNG DỤNG ĐẠO HÀM ĐỂ KHẢO SÁT VÀ VẼ ĐỒ THỊ HÀM SỐ",
      "content": "Tìm hiểu phương pháp tìm giá trị lớn nhất và giá trị nhỏ nhất của một hàm số trên một đoạn hoặc một khoảng.",
      "objectives": [
        "Tìm giá trị lớn nhất, giá trị nhỏ nhất của hàm số trên một đoạn.",
        "Tìm giá trị lớn nhất, giá trị nhỏ nhất của hàm số trên một khoảng."
      ],
      "common_exercises": [
        "Tìm GTLN, GTNN của hàm số trên đoạn.",
        "Tìm GTLN, GTNN của hàm số trên khoảng."
      ]
    },
    "Bài 3. Đường tiệm cận của đồ thị hàm số": {
      "chapter": "ỨNG DỤNG ĐẠO HÀM ĐỂ KHẢO SÁT VÀ VẼ ĐỒ THỊ HÀM SỐ",
      "content": "Nghiên cứu về các loại đường tiệm cận (đứng, ngang, xiên) của đồ thị hàm số và cách tìm chúng.",
      "objectives": [
        "Tìm tiệm cận đứng, tiệm cận ngang của đồ thị hàm số.",
        "Tìm tiệm cận xiên của đồ thị hàm số."
      ],
      "common_exercises": [
        "Tìm tiệm cận đứng, ngang của đồ thị hàm số.",
        "Tìm tiệm cận xiên của đồ thị hàm số."
      ]
    },
    "Bài 4. Khảo sát sự biến thiên và vẽ đồ thị của hàm số": {
      "chapter": "ỨNG DỤNG ĐẠO HÀM ĐỂ KHẢO SÁT VÀ VẼ ĐỒ THỊ HÀM SỐ",
      "content": "Tổng hợp các kiến thức về đạo hàm để khảo sát sự biến thiên và vẽ đồ thị của các hàm số đa thức và phân thức.",
      "objectives": [
        "Thực hiện đầy đủ các bước khảo sát sự biến thiên và vẽ đồ thị của hàm số bậc ba, bậc bốn trùng phương, phân thức hữu tỉ.",
        "Dựa vào đồ thị hoặc bảng biến thiên để biện luận số nghiệm của phương trình f(x) = m."
      ],
      "common_exercises": [
        "Khảo sát và vẽ đồ thị hàm số bậc ba, bậc bốn, phân thức.",
        "Biện luận số nghiệm của phương trình bằng đồ thị."
      ]
    },
    "Bài 5. Ứng dụng đạo hàm để giải quyết một số vấn đề liên quan đến thực tiễn": {
      "chapter": "ỨNG DỤNG ĐẠO HÀM ĐỂ KHẢO SÁT VÀ VẼ ĐỒ THỊ HÀM SỐ",
      "content": "Vận dụng đạo hàm và các kiến thức liên quan để giải quyết các bài toán tối ưu hóa trong các lĩnh vực thực tế.",
      "objectives": [
        "Giải các bài toán về tốc độ thay đổi của một đại lượng.",
        "Giải các bài toán tối ưu hóa trong thực tế (tối đa hóa lợi nhuận, thể tích; tối thiểu hóa chi phí, diện tích)."
      ],
      "common_exercises": [
        "Giải bài toán tối ưu hóa trong hình học.",
        "Giải bài toán tối ưu hóa trong kinh tế, vật lý."
      ]
    },
    "Bài 6. Vecto trong không gian": {
      "chapter": "VECTƠ VÀ HỆ TRỤC TOẠ ĐỘ TRONG KHÔNG GIAN",
      "content": "Nghiên cứu các phép toán vectơ trong không gian và các quy tắc hình học liên quan.",
      "objectives": [
        "Thực hiện các phép toán cộng, trừ vectơ, nhân vectơ với một số trong không gian.",
        "Chứng minh các đẳng thức vectơ, các tính chất hình học bằng phương pháp vectơ (quy tắc hình hộp, trung điểm, trọng tâm)."
      ],
      "common_exercises": [
        "Chứng minh đẳng thức vectơ trong không gian.",
        "Chứng minh các tính chất hình học bằng vectơ."
      ]
    },
    "Bài 7. Hệ trục toạ độ trong không gian": {
      "chapter": "VECTƠ VÀ HỆ TRỤC TOẠ ĐỘ TRONG KHÔNG GIAN",
      "content": "Tìm hiểu về hệ trục tọa độ Oxyz và cách xác định tọa độ của điểm, vectơ trong không gian.",
      "objectives": [
        "Xác định tọa độ của điểm, vectơ trong không gian Oxyz.",
        "Tìm tọa độ điểm thỏa mãn điều kiện hình học cho trước."
      ],
      "common_exercises": [
        "Xác định tọa độ điểm, vectơ trong không gian.",
        "Tìm tọa độ điểm thỏa mãn điều kiện."
      ]
    },
    "Bài 8. Biểu thức toạ độ của các phép toán vecto": {
      "chapter": "VECTƠ VÀ HỆ TRỤC TOẠ ĐỘ TRONG KHÔNG GIAN",
      "content": "Nghiên cứu cách thực hiện các phép toán vectơ, tính tích vô hướng, tích có hướng thông qua tọa độ và các ứng dụng của chúng.",
      "objectives": [
        "Thực hiện các phép toán vectơ thông qua tọa độ.",
        "Tính độ dài đoạn thẳng, khoảng cách giữa hai điểm.",
        "Tính tích vô hướng, tích có hướng của hai vectơ.",
        "Ứng dụng tích có hướng để tính diện tích tam giác, thể tích khối hộp, khối tứ diện.",
        "Kiểm tra sự đồng phẳng của ba vectơ, sự đồng phẳng của bốn điểm."
      ],
      "common_exercises": [
        "Tính tích vô hướng và tích có hướng.",
        "Ứng dụng tích có hướng để tính diện tích, thể tích.",
        "Kiểm tra sự đồng phẳng."
      ]
    },
    "Bài 9. Khoảng biến thiên và khoảng tứ phân vị": {
      "chapter": "THỐNG KÊ",
      "content": "Nghiên cứu cách tính và ý nghĩa của khoảng biến thiên và khoảng tứ phân vị cho mẫu số liệu ghép nhóm.",
      "objectives": [
        "Tính khoảng biến thiên, khoảng tứ phân vị cho mẫu số liệu ghép nhóm."
      ],
      "common_exercises": [
        "Tính khoảng biến thiên và khoảng tứ phân vị.",
        "Phân tích ý nghĩa của các số đặc trưng đo độ phân tán."
      ]
    },
    "Bài 10. Phương sai và độ lệch chuẩn": {
      "chapter": "THỐNG KÊ",
      "content": "Nghiên cứu cách tính và ý nghĩa của phương sai và độ lệch chuẩn cho mẫu số liệu ghép nhóm để so sánh mức độ phân tán.",
      "objectives": [
        "Tính phương sai, độ lệch chuẩn cho mẫu số liệu ghép nhóm.",
        "So sánh mức độ phân tán của hai hay nhiều mẫu số liệu ghép nhóm."
      ],
      "common_exercises": [
        "Tính phương sai và độ lệch chuẩn.",
        "So sánh độ phân tán của các mẫu số liệu."
      ]
    },
    "Bài 11. Nguyên hàm": {
      "chapter": "NGUYÊN HÀM - TÍCH PHÂN VÀ ỨNG DỤNG",
      "content": "Tìm hiểu về khái niệm nguyên hàm và các phương pháp tìm nguyên hàm của một hàm số.",
      "objectives": [
        "Tìm nguyên hàm của hàm số bằng cách sử dụng bảng nguyên hàm cơ bản và các tính chất.",
        "Tìm một nguyên hàm của hàm số thỏa mãn điều kiện ban đầu."
      ],
      "common_exercises": [
        "Tìm nguyên hàm bằng bảng và tính chất.",
        "Tìm nguyên hàm thỏa mãn điều kiện cho trước."
      ]
    },
    "Bài 12. Tích phân": {
      "chapter": "NGUYÊN HÀM - TÍCH PHÂN VÀ ỨNG DỤNG",
      "content": "Nghiên cứu về định nghĩa, tính chất của tích phân và các phương pháp tính tích phân như đổi biến số, tích phân từng phần.",
      "objectives": [
        "Tính tích phân bằng định nghĩa (công thức Newton-Leibniz).",
        "Vận dụng các tính chất của tích phân để tính toán.",
        "Tính tích phân bằng phương pháp đổi biến số.",
        "Tính tích phân bằng phương pháp tích phân từng phần."
      ],
      "common_exercises": [
        "Tính tích phân bằng phương pháp đổi biến số.",
        "Tính tích phân bằng phương pháp từng phần."
      ]
    },
    "Bài 13. Ứng dụng hình học của tích phân": {
      "chapter": "NGUYÊN HÀM - TÍCH PHÂN VÀ ỨNG DỤNG",
      "content": "Vận dụng tích phân để tính diện tích hình phẳng và thể tích của vật thể, khối tròn xoay.",
      "objectives": [
        "Tính diện tích hình phẳng giới hạn bởi một đồ thị hàm số và trục hoành.",
        "Tính diện tích hình phẳng giới hạn bởi hai đồ thị hàm số.",
        "Tính thể tích khối tròn xoay khi quay hình phẳng giới hạn bởi một đồ thị, trục Ox quanh trục Ox.",
        "Tính thể tích vật thể khi biết diện tích mặt cắt ngang."
      ],
      "common_exercises": [
        "Tính diện tích hình phẳng.",
        "Tính thể tích khối tròn xoay."
      ]
    },
    "Bài 14. Phương trình mặt phẳng": {
      "chapter": "PHƯƠNG PHÁP TỌA ĐỘ TRONG KHÔNG GIAN",
      "content": "Nghiên cứu cách viết phương trình mặt phẳng trong không gian, xét vị trí tương đối và tính khoảng cách.",
      "objectives": [
        "Viết phương trình mặt phẳng khi biết một điểm và một vectơ pháp tuyến.",
        "Viết phương trình mặt phẳng đi qua ba điểm không thẳng hàng.",
        "Viết phương trình mặt phẳng trung trực của một đoạn thẳng.",
        "Xét vị trí tương đối giữa hai mặt phẳng.",
        "Tính khoảng cách từ một điểm đến một mặt phẳng."
      ],
      "common_exercises": [
        "Viết phương trình mặt phẳng.",
        "Tính khoảng cách từ điểm đến mặt phẳng."
      ]
    },
    "Bài 15. Phương trình đường thẳng trong không gian": {
      "chapter": "PHƯƠNG PHÁP TỌA ĐỘ TRONG KHÔNG GIAN",
      "content": "Nghiên cứu cách viết phương trình tham số, chính tắc của đường thẳng và xét vị trí tương đối giữa hai đường thẳng trong không gian.",
      "objectives": [
        "Viết phương trình tham số, chính tắc của đường thẳng.",
        "Xét vị trí tương đối giữa hai đường thẳng.",
        "Viết phương trình đường thẳng đi qua một điểm và vuông góc với một mặt phẳng."
      ],
      "common_exercises": [
        "Viết phương trình đường thẳng.",
        "Xét vị trí tương đối của hai đường thẳng."
      ]
    },
    "Bài 16. Công thức tính góc trong không gian": {
      "chapter": "PHƯƠNG PHÁP TỌA ĐỘ TRONG KHÔNG GIAN",
      "content": "Nghiên cứu các công thức tính góc giữa hai đường thẳng, giữa đường thẳng và mặt phẳng, và giữa hai mặt phẳng bằng phương pháp tọa độ.",
      "objectives": [
        "Tính góc giữa hai đường thẳng.",
        "Tính góc giữa đường thẳng và mặt phẳng.",
        "Tính góc giữa hai mặt phẳng."
      ],
      "common_exercises": [
        "Tính góc giữa đường thẳng và mặt phẳng.",
        "Tính góc giữa hai mặt phẳng."
      ]
    },
    "Bài 17. Phương trình mặt cầu": {
      "chapter": "PHƯƠNG PHÁP TỌA ĐỘ TRONG KHÔNG GIAN",
      "content": "Nghiên cứu về phương trình mặt cầu và xét vị trí tương đối của mặt cầu với điểm, đường thẳng, mặt phẳng.",
      "objectives": [
        "Viết phương trình mặt cầu khi biết tâm và bán kính.",
        "Xác định tâm và bán kính của mặt cầu từ phương trình.",
        "Xét vị trí tương đối của điểm, đường thẳng, mặt phẳng với mặt cầu."
      ],
      "common_exercises": [
        "Viết phương trình mặt cầu.",
        "Xét vị trí tương đối của mặt cầu và mặt phẳng."
      ]
    },
    "Bài 18. Xác suất có điều kiện": {
      "chapter": "XÁC SUẤT CÓ ĐIỀU KIỆN",
      "content": "Tìm hiểu về khái niệm xác suất có điều kiện và công thức nhân xác suất cho hai biến cố bất kì.",
      "objectives": [
        "Tính xác suất có điều kiện của một biến cố.",
        "Áp dụng công thức nhân xác suất cho hai biến cố bất kì.",
        "Phân tích và giải các bài toán xác suất từ bảng dữ liệu thống kê 2x2."
      ],
      "common_exercises": [
        "Tính xác suất có điều kiện.",
        "Sử dụng công thức nhân xác suất."
      ]
    },
    "Bài 19. Công thức xác suất toàn phần và công thức Bayes": {
      "chapter": "XÁC SUẤT CÓ ĐIỀU KIỆN",
      "content": "Nghiên cứu và vận dụng công thức xác suất toàn phần và công thức Bayes để giải quyết các bài toán xác suất phức tạp.",
      "objectives": [
        "Vận dụng công thức xác suất toàn phần để tính xác suất của một biến cố.",
        "Vận dụng công thức Bayes để cập nhật xác suất của một giả thuyết khi có thông tin mới."
      ],
      "common_exercises": [
        "Sử dụng công thức xác suất toàn phần.",
        "Sử dụng công thức Bayes."
      ]
    }
  }
}
